{
  "bodyPart": "adductors",
  "exercises": [
    {
      "id": "adductors-1",
      "name": "Hip Adduction Machine",
      "description": "The hip adduction machine exercise is an exercise used to strengthen the muscles of the adductors. Having strong adductor plays a critical role in using maximal weights on lower body exercises such as squats and lunges. From an aesthetic standpoint, using the hip adduction machine can help in building shapely inner thighs.",
      "targetBodyParts": [
        "Adductors"
      ],
      "exerciseType": [
        "strength"
      ],
      "difficulty": "beginner",
      "equipment": [
        "Machine"
      ],
      "steps": [
        "Setup in an upright position with your back against the pad and your spine neutral.",
        "Exhale and pull the legs together as you squeeze the pads inward.",
        "Once the pads touch, slowly return to the starting position.",
        "Repeat for the desired number of repetitions."
      ],
      "tips": [
        "Experiment with foot and pelvis position. Depending upon the shape of your hip, you may need a slightly more internal or external starting position to fully maximize the contraction.\n          Similarly, be mindful of your pelvic position - don’t allow the back to arch as this will tip the hips forward and place the adductors under excessive stretch before the contraction which can affect force output.\n          If you can’t seem to figure out how to change the position of your pelvis while seated, experiment with changing the position of the torso (i.e. lean forward or push your back into the pad).",
        "Similarly, be mindful of your pelvic position - don’t allow the back to arch as this will tip the hips forward and place the adductors under excessive stretch before the contraction which can affect force output.",
        "If you can’t seem to figure out how to change the position of your pelvis while seated, experiment with changing the position of the torso (i.e. lean forward or push your back into the pad)."
      ],
      "contraindications": [
        "Adductors injury",
        "Joint pain",
        "Acute pain during movement",
        "Shoulder impingement"
      ],
      "muscles": [
        "Adductors",
        "Glutes",
        "Hamstrings"
      ],
      "alternatives": [
        "adductors-3",
        "adductors-2",
        "adductors-4",
        "adductors-5",
        "adductors-6"
      ],
      "repetitions": 12,
      "sets": 3,
      "restBetweenSets": 60,
      "forceType": "Push (Bilateral)",
      "mechanics": "Isolation",
      "videoUrl": "https://www.youtube.com/embed/Oj7IN952fSg?rel=0",
      "imageUrl": "https://cdn.muscleandstrength.com/sites/all/themes/mnsnew/images/taxonomy/exercises/muscle-groups/full/Adductors.jpg",
      "viewCount": 254400,
      "popularity": "medium"
    },
    {
      "id": "adductors-2",
      "name": "Alternating Lateral Lunge with Overhead Reach",
      "description": "The alternating lateral lunge with overhead reach is a warm-up exercise used to dynamically stretch the lower body, shoulders, and upper back. The stretch primarily increases mobility in the groin, but will also be felt in the shoulders. Warming up adequately is an important part of any workout routine, and maintaining mobility can increase the overall effectiveness of certain exercises.",
      "targetBodyParts": [
        "Adductors"
      ],
      "exerciseType": [
        "warmup"
      ],
      "difficulty": "beginner",
      "equipment": [
        "Bodyweight"
      ],
      "steps": [
        "Stand in an upright position with your feet together and arms at your sides.",
        "Step laterally and sit back into your hip while you extend your opposite leg.",
        "Once at the bottom of the lateral lunge, keep your arms straight and raise them into shoulder flexion.",
        "After you reach overhead, lower the arms and push back to your starting position.",
        "Repeat for the desired number of repetitions on both sides."
      ],
      "tips": [
        "As your raise the arms overhead, make sure the movements comes entirely from the shoulders and not the spine.",
        "Exhale as you reach and focus on activating the musculature of your upper back and posterior shoulder.",
        "During the lateral lunge, if you’re able to descend deep into the movement, experiment with allowing the sole of the shoe to come off the floor and point your toes towards the ceiling. Depending upon each individual’s bony hip anatomy, this may feel better."
      ],
      "contraindications": [
        "Adductors injury",
        "Joint pain",
        "Acute pain during movement",
        "Recent surgery",
        "Severe cardiovascular issues (for heavy compound movements)"
      ],
      "muscles": [
        "Adductors",
        "Calves",
        "Hamstrings",
        "Shoulders",
        "Upper Back"
      ],
      "alternatives": [
        "adductors-5",
        "adductors-6",
        "adductors-4",
        "adductors-1",
        "adductors-3"
      ],
      "repetitions": 12,
      "sets": 3,
      "restBetweenSets": 60,
      "forceType": "Dynamic Stretching",
      "mechanics": "Compound",
      "videoUrl": "https://www.youtube.com/embed/cGQ3H4sZbSM?rel=0",
      "imageUrl": "https://cdn.muscleandstrength.com/sites/all/themes/mnsnew/images/taxonomy/exercises/muscle-groups/full/Adductors.jpg",
      "viewCount": 12900,
      "popularity": "low"
    },
    {
      "id": "adductors-3",
      "name": "Cable Hip Adduction",
      "targetBodyParts": [
        "Adductors"
      ],
      "exerciseType": [
        "strength"
      ],
      "difficulty": "beginner",
      "equipment": [
        "Cable"
      ],
      "steps": [
        "Attach an ankle strap to a low pulley on a cable machine.",
        "Stand next to the pulley machine and attach the ankle strap to the ankle closest to the pulley machine.",
        "Stand with feet shoulder-width apart, and hold onto the machine or nearby support for balance.",
        "Keeping your leg straight, lift the working left and move it across your body until your ankle passes your stationary leg.",
        "Pause, then slowly return your leg to the starting position with control, resisting the cable tension.",
        "Perform the desired number of reps, then switch legs."
      ],
      "tips": [
        "Maintain proper form throughout the exercise.",
        "Start with a lighter weight to practice the movement pattern.",
        "Breathe out during the exertion phase of the exercise."
      ],
      "contraindications": [
        "Adductors injury",
        "Joint pain",
        "Acute pain during movement"
      ],
      "muscles": [
        "Adductors",
        "Glutes",
        "Hamstrings"
      ],
      "alternatives": [
        "adductors-1",
        "adductors-2",
        "adductors-4",
        "adductors-5",
        "adductors-6"
      ],
      "repetitions": 12,
      "sets": 3,
      "restBetweenSets": 60,
      "forceType": "N/A",
      "mechanics": "Isolation",
      "videoUrl": "https://player.vimeo.com/video/760008232?badge=0&autopause=0&player_id=0&app_id=58479",
      "imageUrl": "https://cdn.muscleandstrength.com/sites/all/themes/mnsnew/images/taxonomy/exercises/muscle-groups/full/Adductors.jpg",
      "viewCount": 18700,
      "popularity": "low"
    },
    {
      "id": "adductors-4",
      "name": "Deep Squat Prying",
      "description": "The deep squat prying drill is both an activation exercise and a drill that promotes increased mobility. The deep squat portion of the drill is beneficial in activating the muscles of the lower body including the adductors, quads, glutes, and hamstrings. The prying part of the drill helps open up the hips to promote more fluid range of motions during your working sets later in the workout. One would typically perform the deep squat prying drill at the beginning of their workouts as a dynamic stretch in their specific warm up routine.",
      "targetBodyParts": [
        "Adductors"
      ],
      "exerciseType": [
        "warmup"
      ],
      "difficulty": "beginner",
      "equipment": [
        "Kettle Bells"
      ],
      "steps": [
        "In a standing position with a shoulder width stance, hold a kettlebell at chest height using both hands.",
        "Squat down by breaking at the hips and knees simultaneously. Sit as deep as comfortably possible.",
        "Rock from side to side while flexing the ankles and pushing the knees out with the elbows to open up the hips.",
        "Repeat for the desired number of repetitions or time."
      ],
      "tips": [
        "Focus on keeping your spine tall in the bottom position and don’t allow the weight to pull your forward.",
        "Ideally you should be able to sit comfortably in the bottom position and open up the hips and ankles as you rock side to side.",
        "To get into a deep squat, you should try to focus on sitting down rather than back to keep your torso upright."
      ],
      "contraindications": [
        "Adductors injury",
        "Joint pain",
        "Acute pain during movement",
        "Recent surgery",
        "Severe cardiovascular issues (for heavy compound movements)"
      ],
      "muscles": [
        "Adductors",
        "Glutes",
        "Hamstrings",
        "Hip Flexors",
        "Quads"
      ],
      "alternatives": [
        "adductors-2",
        "adductors-5",
        "adductors-6",
        "adductors-1",
        "adductors-3"
      ],
      "repetitions": 12,
      "sets": 3,
      "restBetweenSets": 60,
      "forceType": "Dynamic Stretching",
      "mechanics": "Compound",
      "videoUrl": "https://www.youtube.com/embed/GWhI41W8xnk?rel=0",
      "imageUrl": "https://cdn.muscleandstrength.com/sites/all/themes/mnsnew/images/taxonomy/exercises/muscle-groups/full/Adductors.jpg",
      "viewCount": 13400,
      "popularity": "low"
    },
    {
      "id": "adductors-5",
      "name": "Lateral Kneeling Adductor Mobilization",
      "description": "The lateral kneeling adductor mobilization drill is a form of dynamic stretching and an exercise used to alleviate tension in the adductors. Ensuring you’re properly warmed up is important for maximizing your time in the gym and avoiding injury.",
      "targetBodyParts": [
        "Adductors"
      ],
      "exerciseType": [
        "warmup"
      ],
      "difficulty": "beginner",
      "equipment": [
        "Bodyweight"
      ],
      "steps": [
        "In an quadruped position, ensure the toes are tucked and the hands are directly underneath the shoulders.",
        "Straighten one leg to the side and keep the foot flat on the floor.",
        "Exhale and push your hands into the floor to direct your hips backwards to increase the stretch on your groin.",
        "Once you run out of range of motion in your adductor, rock back to the starting position and repeat for the assigned number of repetitions on both sides."
      ],
      "tips": [
        "If you feel a pinch on the outside of the hip joint instead of a stretch on the inside portion (i.e. the adductor) then you may have adopted a stance is slightly too wide and as such you’re getting a bit of bone on bone contact. Bring your stance in a touch and push back a bit further or switch to more advanced progression such as a cossack squat.",
        "Focus on keeping your spine neutral by thinking about “making your spine long” as you rock back.",
        "If you feel your pelvis rolling underneath or spine rounding, then you’ve essentially run out of range of motion at the hip and you’re not compensating with the spine.",
        "Move slowly and methodically, to be able to use new ranges of motion, you must be able to control them."
      ],
      "contraindications": [
        "Adductors injury",
        "Joint pain",
        "Acute pain during movement",
        "Recent surgery",
        "Severe cardiovascular issues (for heavy compound movements)"
      ],
      "muscles": [
        "Adductors",
        "Calves"
      ],
      "alternatives": [
        "adductors-2",
        "adductors-6",
        "adductors-4",
        "adductors-1",
        "adductors-3"
      ],
      "repetitions": 12,
      "sets": 3,
      "restBetweenSets": 60,
      "forceType": "Dynamic Stretching",
      "mechanics": "Compound",
      "videoUrl": "https://www.youtube.com/embed/NsZRuAHF7sI?rel=0&showinfo=0",
      "imageUrl": "https://cdn.muscleandstrength.com/sites/all/themes/mnsnew/images/taxonomy/exercises/muscle-groups/full/Adductors.jpg",
      "viewCount": 5300,
      "popularity": "low"
    },
    {
      "id": "adductors-6",
      "name": "Rocking Frog Stretch",
      "description": "The rocking frog stretching drill is a form of dynamic stretching that warms up the muscles of the groin, upper back and shoulders. Dynamic stretching is critical prior to performing your workouts as it allows you to activate your central nervous system and engage the muscle groups you’ll use later in your workout. Incorporating them into your warm up routine will help you get better results and avoid injury.",
      "targetBodyParts": [
        "Adductors"
      ],
      "exerciseType": [
        "warmup"
      ],
      "difficulty": "beginner",
      "equipment": [
        "Bodyweight"
      ],
      "steps": [
        "In a quadruped position, ensure the hands are underneath the shoulders, the knees are underneath the hips, and the toes are tucked.",
        "Spread the knees wide until you feel a stretch within your groin. From here, push your hands into the ground to drive your hips back and keep your chest upright.",
        "Push back until your hips run out of range of motion and then return to the starting position.",
        "Repeat for the desired number of repetitions."
      ],
      "tips": [
        "Focus on keeping all of the movement relegated to the hip, don’t allow the spine to move to compensate a lack of hip mobility.",
        "Push into the floor with your hands and focus on keeping the head neutral.",
        "If you feel a pinch in the front portion of your hips while you rock back, experiment with different knee widths. Depending upon your individual anatomy, you may need a slightly wider or narrower stance."
      ],
      "contraindications": [
        "Adductors injury",
        "Joint pain",
        "Acute pain during movement",
        "Recent surgery",
        "Severe cardiovascular issues (for heavy compound movements)"
      ],
      "muscles": [
        "Adductors",
        "Shoulders",
        "Upper Back"
      ],
      "alternatives": [
        "adductors-2",
        "adductors-5",
        "adductors-4",
        "adductors-1",
        "adductors-3"
      ],
      "repetitions": 12,
      "sets": 3,
      "restBetweenSets": 60,
      "forceType": "Dynamic Stretching",
      "mechanics": "Compound",
      "videoUrl": "https://www.youtube.com/embed/ABcuTyDyRhU?rel=0&showinfo=0",
      "imageUrl": "https://cdn.muscleandstrength.com/sites/all/themes/mnsnew/images/taxonomy/exercises/muscle-groups/full/Adductors.jpg",
      "viewCount": 13800,
      "popularity": "low"
    }
  ]
}