{
  "bodyPart": "lower back",
  "exercises": [
    {
      "id": "lower-back-1",
      "name": "Dumbbell Deadlift",
      "targetBodyParts": [
        "Lower Back"
      ],
      "exerciseType": [
        "strength"
      ],
      "difficulty": "beginner",
      "equipment": [
        "Dumbbell"
      ],
      "steps": [
        "Set up for the dumbbell deadlift by choosing a pair of dumbbells and placing them on the floor in front of you.",
        "Stand with your feet at around shoulder width apart and position the dumbbells on the floor so that they are on either side of your feet.",
        "Reach down and grab the dumbbells with a neutral grip (palms facing inward) and drop your hips.Your hips should be in the best, most natural position for leverage so you may need to raise or lower them slightly.",
        "Make sure your eyes are looking ahead. Your body will follow your head so keep your head up and eyes forward!",
        "Be sure to keep a straight back and never allow it to round. You are now in the starting position.",
        "Focus on standing up with the dumbbells - not pulling them from the floor, and lead with your head as you rise.",
        "Drive with your heals and explode upward (leading with your head) as you rise.",
        "As the dumbbells rise to knee level, thrust your hips forward and contract your back by bringing your shoulder blades back.",
        "Pause here for a moment and then reverse the movement by bending at the knees while slowly lowering the weight - keeping the dumbbells under strict control on the descent.",
        "Reset your stance if necessary and repeat for desired reps.",
        "The biggest mistake you can make is trying to perform deadlifts from an unnatural body position. Read and re-read the form tips presented in this guide and practice them with a moderate weight. Start the deadlift with the hips in a position of strength and maximal leverage. If you start the deadlift with your hips too high you will be at a mechanical disadvantage and will tax your lower back. Starting with your hips too low will also cause you to lose your leverage and power.",
        "If you start the deadlift while looking down, there is a good chance your hips will lift up causing you to lose form and lift with your lower back. This is a very common deadlift mistake. Think about exploding your head upward while trying to stand erect. The body will follow the head.",
        "As the weight gets heavy, lifting straps can be used to lift more weight than your grip strength would allow."
      ],
      "tips": [
        "The biggest mistake you can make is trying to perform deadlifts from an unnatural body position. Read and re-read the form tips presented in this guide and practice them with a moderate weight. Start the deadlift with the hips in a position of strength and maximal leverage. If you start the deadlift with your hips too high you will be at a mechanical disadvantage and will tax your lower back. Starting with your hips too low will also cause you to lose your leverage and power.",
        "If you start the deadlift while looking down, there is a good chance your hips will lift up causing you to lose form and lift with your lower back. This is a very common deadlift mistake. Think about exploding your head upward while trying to stand erect. The body will follow the head.",
        "As the weight gets heavy, lifting straps can be used to lift more weight than your grip strength would allow."
      ],
      "contraindications": [
        "Lower Back injury",
        "Joint pain",
        "Acute pain during movement",
        "Recent surgery",
        "Severe cardiovascular issues (for heavy compound movements)"
      ],
      "muscles": [
        "Lower Back",
        "Calves",
        "Forearms",
        "Glutes",
        "Hamstrings",
        "Middle Back",
        "Quads",
        "Traps"
      ],
      "alternatives": [
        "lower-back-3",
        "lower-back-2",
        "lower-back-4",
        "lower-back-5"
      ],
      "repetitions": 8,
      "sets": 3,
      "restBetweenSets": 60,
      "forceType": "Pull",
      "mechanics": "Compound",
      "imageUrl": "https://cdn.muscleandstrength.com/sites/all/themes/mnsnew/images/taxonomy/exercises/muscle-groups/full/Lower-Back.jpg",
      "viewCount": 1700000,
      "popularity": "high"
    },
    {
      "id": "lower-back-2",
      "name": "Superman",
      "description": "The superman is an exercise used to isolate the muscles of the lower back. One can risk injury through over extending the spine with this exercise. There are better ways to target your back (indirectly) to strengthen your lower back and build lean muscle mass.",
      "targetBodyParts": [
        "Lower Back"
      ],
      "exerciseType": [
        "strength"
      ],
      "difficulty": "beginner",
      "equipment": [
        "Bodyweight"
      ],
      "steps": [
        "Set up in a prone position with your hands by your side (or behind your back) and your feet together.",
        "Extend your lower back by contracting your spinal erectors.",
        "Slowly lower back to the starting position and repeat for the desired number of repetitions."
      ],
      "tips": [
        "Make sure to keep some tension through your abs and glutes as you complete the movement. If you feeling a pressure or pinching sensation within one spinal vertebrae directly then you are dealing with an issue of segmental extension (usually at your thoracolumbar junction: T12-L1) versus global extension.",
        "This movement is fairly outdated and there are much better options given the high level of compression that is generated within the spine itself during the course of the movement."
      ],
      "contraindications": [
        "Lower Back injury",
        "Joint pain",
        "Acute pain during movement"
      ],
      "muscles": [
        "Lower Back",
        "Glutes"
      ],
      "alternatives": [
        "lower-back-1",
        "lower-back-4",
        "lower-back-5",
        "lower-back-3"
      ],
      "repetitions": 12,
      "sets": 3,
      "restBetweenSets": 60,
      "forceType": "Hinge (Bilateral)",
      "mechanics": "Isolation",
      "videoUrl": "https://www.youtube.com/embed/D07urmRplHQ?rel=0",
      "imageUrl": "https://cdn.muscleandstrength.com/sites/all/themes/mnsnew/images/taxonomy/exercises/muscle-groups/full/Lower-Back.jpg",
      "viewCount": 101900,
      "popularity": "medium"
    },
    {
      "id": "lower-back-3",
      "name": "Smith Machine Deadlift",
      "targetBodyParts": [
        "Lower Back"
      ],
      "exerciseType": [
        "strength"
      ],
      "difficulty": "intermediate",
      "equipment": [
        "Machine"
      ],
      "steps": [
        "Set up for the smith machine deadlift by loading the appropriate amount of weight onto the smith machine and setting the bar to the lowest setting.",
        "Stand in front of the bar with your feet around shoulder width apart and halfway under the loaded bar. Your toes should be pointed straight ahead or slightly outward. Do what is comfortable for you.",
        "Reach down and grab the bar with both hands using an overhand grip just outside of shoulder width. You can use an alternating grip (one over/one under) to help you lift more weight. Lifting straps can also be used to help lift more weight.",
        "Drop your hips until your shins are touching the barbell. Your hips should be in the best, most natural position for leverage so you may need to raise or lower them slightly.",
        "Make sure your eyes are looking ahead. Your body will follow your head so keep your head up and eyes forward!",
        "Be sure to keep a straight back and never allow it to round. You are now in the starting position.",
        "Focus on standing up with the bar - not pulling the bar from the floor, and lead with your head as you rise.",
        "Drive with your heels and explode upward (leading with your head) as you rise.",
        "As the bar rises above your knees, thrust your hips forward and contract your back by bringing your shoulder blades back.",
        "Pause here for a moment and then reverse the movement by bending at the knees while slowly lowering the weight - keeping it under strict control on the descent.",
        "Reset your stance if necessary and repeat for desired reps."
      ],
      "tips": [
        "When positioning your feet under the bar (with the bar over the halfway point from your heels to toes) it can be difficult to gauge if your foot position is correct, so ask another lifter for guidance or record your deadlift setup.",
        "Use an alternating grip if the weight gets too heavy. Using lifting straps will also allow you to lift heavier than your grip strength will allow.",
        "The biggest mistake you can make is trying to perform deadlifts from an unnatural body position. Read and re-read the form tips presented in this guide and practice them with a moderate weight. Start the deadlift with the hips in a position of strength and maximal leverage.",
        "If you start the deadlift with your hips too high you will be at a mechanical disadvantage and will tax your lower back. Starting with your hips too low will also cause you to lose your leverage and power. If you start the deadlift while looking down, there is a good chance your hips will lift causing you to lose form and lift with your lower back. This is a very common deadlift mistake. Think about exploding your head upward while trying to stand erect. The body will follow the head."
      ],
      "contraindications": [
        "Lower Back injury",
        "Joint pain",
        "Acute pain during movement",
        "Recent surgery",
        "Severe cardiovascular issues (for heavy compound movements)"
      ],
      "muscles": [
        "Lower Back",
        "Calves",
        "Forearms",
        "Glutes",
        "Hamstrings",
        "Lats",
        "Middle Back",
        "Quads",
        "Traps"
      ],
      "alternatives": [
        "lower-back-1",
        "lower-back-2",
        "lower-back-4",
        "lower-back-5"
      ],
      "repetitions": 12,
      "sets": 3,
      "restBetweenSets": 60,
      "forceType": "Pull",
      "mechanics": "Compound",
      "videoUrl": "https://player.vimeo.com/video/756788871?h=c023e3a08e",
      "imageUrl": "https://cdn.muscleandstrength.com/sites/all/themes/mnsnew/images/taxonomy/exercises/muscle-groups/full/Lower-Back.jpg",
      "viewCount": 135200,
      "popularity": "medium"
    },
    {
      "id": "lower-back-4",
      "name": "90/90 Hip Crossover",
      "description": "The 90/90 hip crossover drill is a great warm up exercise to perform prior to your workouts. The 90/90 hip crossover drill will help relieve tension in the back muscles while also opening up the glutes and shoulders. It can also help increase mobility in the hips and slightly challenge the core.",
      "targetBodyParts": [
        "Lower Back"
      ],
      "exerciseType": [
        "warmup"
      ],
      "difficulty": "beginner",
      "equipment": [
        "Bodyweight"
      ],
      "steps": [
        "In a supine position, lift your legs so that your hips and knees are at a 90 degree angle and ensure that your lower back is flat on the floor.",
        "Reach your arms out to the side for support and slowly rotate your legs side to side.",
        "Keep your head neutral and focus on controlling the rotation by utilizing your abdominals.",
        "Repeat for the desired number of repetitions."
      ],
      "tips": [
        "Ensure the feet don’t drop towards your butt as you get fatigued.",
        "Keep the lower back as flat as possible against the floor and focus on feeling the movement in the upper back.",
        "Don’t rotate the head as the legs move."
      ],
      "contraindications": [
        "Lower Back injury",
        "Joint pain",
        "Acute pain during movement",
        "Recent surgery",
        "Severe cardiovascular issues (for heavy compound movements)"
      ],
      "muscles": [
        "Lower Back",
        "Glutes",
        "Shoulders",
        "Upper Back"
      ],
      "alternatives": [
        "lower-back-5",
        "lower-back-1",
        "lower-back-2",
        "lower-back-3"
      ],
      "repetitions": 12,
      "sets": 3,
      "restBetweenSets": 60,
      "forceType": "Dynamic Stretching",
      "mechanics": "Compound",
      "videoUrl": "https://www.youtube.com/embed/rPqdiiX2aZA?rel=0",
      "imageUrl": "https://cdn.muscleandstrength.com/sites/all/themes/mnsnew/images/taxonomy/exercises/muscle-groups/full/Lower-Back.jpg",
      "viewCount": 23500,
      "popularity": "low"
    }
  ]
}