{
  "bodyPart": "traps",
  "exercises": [
    {
      "id": "traps-1",
      "name": "Dumbbell Shrug",
      "description": "The dumbbell shrug is a variation of the shrug and an exercise used to build trap muscle size. Traps, being a stubborn muscle group for many, can be trained with a fairly high frequency during the week. When doing so, be sure to mix up the volume, intensity, and implements you use to train the traps. Dumbbell shrugs can be included into your shoulder workouts, back workouts, upper body workouts, and full body workouts.",
      "targetBodyParts": [
        "Traps"
      ],
      "exerciseType": [
        "strength"
      ],
      "difficulty": "beginner",
      "equipment": [
        "Dumbbell"
      ],
      "steps": [
        "Assume a standing position with the dumbbells on both sides of your body.",
        "Hinge forward, inhale, and grab the dumbbells with a neutral grip.",
        "Stand up tall and ensure your spine remains neutral.",
        "Contract the traps to elevate the shoulders. Squeeze hard at the top and slowly lower the dumbbells back to the starting position.",
        "Repeat for the desired number of repetitions."
      ],
      "tips": [
        "Looking slightly up while shrugging may enhance the contraction as traps help to control movement of the skull. This motion should be smooth and controlled, as a ballistic movement could result in a neck injury.",
        "The traps tend to respond well to high reps and explosive movements (e.g. snatch grip high pulls) so program your accessory work accordingly.",
        "Limit momentum and excessive jerking or bouncing of the weight. No one cares about how much you shrug.",
        "Don’t allow the head to jut forward excessively as you squeeze the traps, this can put the neck in a compromised position and result in an injury.",
        "Adding a pause at the top of the movement can help to enhance the mind muscle connection."
      ],
      "contraindications": [
        "Traps injury",
        "Joint pain",
        "Acute pain during movement"
      ],
      "muscles": [
        "Traps",
        "Shoulders",
        "Upper Back"
      ],
      "alternatives": [
        "traps-3",
        "traps-4",
        "traps-9",
        "traps-12",
        "traps-13"
      ],
      "repetitions": 12,
      "sets": 3,
      "restBetweenSets": 60,
      "forceType": "Pull (Bilateral)",
      "mechanics": "Isolation",
      "videoUrl": "https://www.youtube.com/embed/dj2Gm628kas?rel=0",
      "imageUrl": "https://cdn.muscleandstrength.com/sites/all/themes/mnsnew/images/taxonomy/exercises/muscle-groups/full/Traps.jpg",
      "viewCount": 3200000,
      "popularity": "high"
    },
    {
      "id": "traps-10",
      "name": "Tate Press",
      "targetBodyParts": [
        "Traps"
      ],
      "exerciseType": [
        "strength"
      ],
      "difficulty": "intermediate",
      "equipment": [
        "Dumbbell"
      ],
      "steps": [
        "To set up for the tate press, choose a pair of dumbbells, rest them on your thighs, and lie down flat on a flat bench.",
        "You can use your thighs to help you push the dumbbells above your body, fully extending your arms at shoulder width apart.",
        "At this point, your palms should be facing forward and the ends of the dumbbells should be touching.",
        "Keeping the dumbbells close, slowly lower them inward to your chest (bending only at your elbow joints) in a semi-circular motion pointing your elbows outward.",
        "Do not allow the dumbbells to rest on your chest, and begin pushing them back up to the starting position using the same semicircular path you used to lower them.",
        "Once the dumbbells have returned to the starting position, pause and then repeat for desired reps."
      ],
      "tips": [
        "For improved stability, try to keep the dumbbells pressed together throughout the movement.",
        "Focus on moving the weight with your triceps, maintaining complete control of the dumbbells as you slowly raise them back to the starting position.",
        "It should take around twice as long to lower the dumbbells as it does to raise them.",
        "In the beginning, use a lighter weight and focus on form. This can be a dangerous exercise if performed incorrectly."
      ],
      "contraindications": [
        "Traps injury",
        "Joint pain",
        "Acute pain during movement",
        "Shoulder impingement",
        "Recent surgery",
        "Severe cardiovascular issues (for heavy compound movements)"
      ],
      "muscles": [
        "Traps",
        "Chest",
        "Shoulders"
      ],
      "alternatives": [
        "traps-5",
        "traps-6",
        "traps-30",
        "traps-1",
        "traps-2"
      ],
      "repetitions": 8,
      "sets": 3,
      "restBetweenSets": 60,
      "forceType": "Push",
      "mechanics": "Compound",
      "imageUrl": "https://cdn.muscleandstrength.com/sites/all/themes/mnsnew/images/taxonomy/exercises/muscle-groups/full/Traps.jpg",
      "viewCount": 88100,
      "popularity": "low"
    },
    {
      "id": "traps-11",
      "name": "T-Bar Machine Shrug",
      "description": "The t-bar machine shrug is an exercise one can use to isolate the muscles of the traps. As opposed to targeting the upper traps, as most shrug variations tend to do, the t-bar machine shrug emphasizes the use of the mid and lower trap area. It is important to train them all to have a well develop set of traps.",
      "targetBodyParts": [
        "Traps"
      ],
      "exerciseType": [
        "strength"
      ],
      "difficulty": "intermediate",
      "equipment": [
        "Machine"
      ],
      "steps": [
        "Assume a prone position on a t-bar machine with your chest on the pad.",
        "Reach forward and grab the handle with a semi pronated grip.",
        "Contract the traps and retract your shoulder blades together to activate all of the traps. Squeeze hard at the top and slowly lower the dumbbells back to the starting position.",
        "Repeat for the desired number of repetitions."
      ],
      "tips": [
        "Looking slightly up while shrugging may enhance the contraction as traps help to control movement of the skull. This motion should be smooth and controlled, as a ballistic movement could result in a neck injury.",
        "The traps tend to respond well to high reps and explosive movements (e.g. snatch grip high pulls) so program your accessory work accordingly.",
        "Limit momentum and excessive jerking or bouncing of the weight. No one cares about how much you shrug.",
        "Don’t allow the head to jut forward excessively as you squeeze the traps, this can put the neck in a compromised position and result in an injury.",
        "Adding a pause at the top of the movement can help to enhance the mind muscle connection."
      ],
      "contraindications": [
        "Traps injury",
        "Joint pain",
        "Acute pain during movement"
      ],
      "muscles": [
        "Traps",
        "Shoulders",
        "Upper Back"
      ],
      "alternatives": [
        "traps-9",
        "traps-18",
        "traps-21",
        "traps-25",
        "traps-1"
      ],
      "repetitions": 12,
      "sets": 3,
      "restBetweenSets": 60,
      "forceType": "Pull (Bilateral)",
      "mechanics": "Isolation",
      "videoUrl": "https://www.youtube.com/embed/MgKQjNlFrrQ?rel=0",
      "imageUrl": "https://cdn.muscleandstrength.com/sites/all/themes/mnsnew/images/taxonomy/exercises/muscle-groups/full/Traps.jpg",
      "viewCount": 7700,
      "popularity": "low"
    },
    {
      "id": "traps-12",
      "name": "Trap Bar Shrug",
      "description": "The trap bar shrug is a variation of the barbell shrug and an exercise used to isolate the traps. The main difference in a trap bar shrug is the hand placement and bar used. By utilizing a neutral hand placement, you’ll be able to maintain proper posture, avoid shoulder impingement, and utilize a heavy load to target the muscles of the traps.",
      "targetBodyParts": [
        "Traps"
      ],
      "exerciseType": [
        "strength"
      ],
      "difficulty": "beginner",
      "equipment": [
        "Trap Bar"
      ],
      "steps": [
        "Position the safeties just below waist height in a rack.",
        "Assume a standing position with your body positioned inside of the trap bar.",
        "Hinge forward, inhale, and grab the bar with a double overhand grip.",
        "Stand up tall and ensure your spine remains neutral.",
        "Contract the traps to elevate the shoulders. Squeeze hard at the top and slowly lower the bar back to the starting position.",
        "Repeat for the desired number of repetitions."
      ],
      "tips": [
        "Looking slightly up while shrugging may enhance the contraction as traps help to control movement of the skull. This motion should be smooth and controlled, as a ballistic movement could result in a neck injury.",
        "The traps tend to respond well to high reps and explosive movements (e.g. snatch grip high pulls) so program your accessory work accordingly.",
        "Limit momentum and excessive jerking or bouncing of the weight. No one cares about how much you shrug.",
        "Don’t allow the head to jut forward excessively as you squeeze the traps, this can put the neck in a compromised position and result in an injury.",
        "Adding a pause at the top of the movement can help to enhance the mind muscle connection."
      ],
      "contraindications": [
        "Traps injury",
        "Joint pain",
        "Acute pain during movement"
      ],
      "muscles": [
        "Traps",
        "Shoulders",
        "Traps"
      ],
      "alternatives": [
        "traps-1",
        "traps-3",
        "traps-9",
        "traps-13",
        "traps-21"
      ],
      "repetitions": 12,
      "sets": 3,
      "restBetweenSets": 60,
      "forceType": "Pull (Bilateral)",
      "mechanics": "Isolation",
      "videoUrl": "https://www.youtube.com/embed/BOqrejM9vgc?rel=0",
      "imageUrl": "https://cdn.muscleandstrength.com/sites/all/themes/mnsnew/images/taxonomy/exercises/muscle-groups/full/Traps.jpg",
      "viewCount": 25900,
      "popularity": "low"
    },
    {
      "id": "traps-13",
      "name": "Cable Shrug",
      "description": "The cable shrug is a variation of the shrug and an exercise used to build the muscles of the traps. Utilizing the cable pulley machine is useful in that it provides constant tension on the target muscle group as you move the weight through the range of motion.",
      "targetBodyParts": [
        "Traps"
      ],
      "exerciseType": [
        "strength"
      ],
      "difficulty": "beginner",
      "equipment": [
        "Cable"
      ],
      "steps": [
        "Set 2 cable handles as low as possible and assume a standing position with one handle in each hand.",
        "Inhale and contract the traps to elevate the shoulders. Squeeze hard at the top and slowly lower the handles back to the starting position.",
        "Repeat for the desired number of repetitions."
      ],
      "tips": [
        "Looking slightly up while shrugging may enhance the contraction as traps help to control movement of the skull. This motion should be smooth and controlled, as a ballistic movement could result in a neck injury.",
        "The traps tend to respond well to high reps and explosive movements (e.g. snatch grip high pulls) so program your accessory work accordingly.",
        "Don’t allow the head to jut forward excessively as you squeeze the traps, this can put the neck in a compromised position and result in an injury.",
        "Adding a pause at the top of the movement can help to enhance the mind muscle connection."
      ],
      "contraindications": [
        "Traps injury",
        "Joint pain",
        "Acute pain during movement"
      ],
      "muscles": [
        "Traps",
        "Shoulders",
        "Upper Back"
      ],
      "alternatives": [
        "traps-1",
        "traps-3",
        "traps-9",
        "traps-12",
        "traps-20"
      ],
      "repetitions": 12,
      "sets": 3,
      "restBetweenSets": 60,
      "forceType": "Pull (Bilateral)",
      "mechanics": "Isolation",
      "videoUrl": "https://www.youtube.com/embed/LwTq3v2GUF4?rel=0",
      "imageUrl": "https://cdn.muscleandstrength.com/sites/all/themes/mnsnew/images/taxonomy/exercises/muscle-groups/full/Traps.jpg",
      "viewCount": 93900,
      "popularity": "low"
    },
    {
      "id": "traps-14",
      "name": "Cable Row to Neck",
      "targetBodyParts": [
        "Traps"
      ],
      "exerciseType": [
        "strength"
      ],
      "difficulty": "beginner",
      "equipment": [
        "Cable"
      ],
      "steps": [
        "Set the appropriate weight on the weight stack and attach a rope attachment to the pulley of a seated row machine.",
        "Grasp each end of the rope with a neutral grip.",
        "With your legs slightly bent and your back straight, pull the weight up slightly off the stack.",
        "You should be sitting upright with your shoulders back. This is the starting position.",
        "Keeping your body in position, pull the rope in and up towards your neck.",
        "As the rope nears your neck, spread it apart so that each hand ends up on either side of your neck near your shoulders.",
        "Pull your shoulder blades back, squeeze, pause, and then slowly lower the weight back to the starting position.",
        "Repeat for desired reps."
      ],
      "tips": [
        "Your back must remain straight at all times. Your torso should be kept still throughout the entire set.",
        "Don\"t let your shoulders hunch over when your arms are extended.",
        "Use the back and trap muscles to move the weight - do not lean forward and use momentum to swing the weight back.",
        "Pausing and squeezing at the top of the movement for a 1-2 count will increase intensity and results."
      ],
      "contraindications": [
        "Traps injury",
        "Joint pain",
        "Acute pain during movement",
        "Recent surgery",
        "Severe cardiovascular issues (for heavy compound movements)"
      ],
      "muscles": [
        "Traps",
        "Lats",
        "Shoulders"
      ],
      "alternatives": [
        "traps-2",
        "traps-5",
        "traps-20",
        "traps-30",
        "traps-4"
      ],
      "repetitions": 12,
      "sets": 3,
      "restBetweenSets": 60,
      "forceType": "Pull",
      "mechanics": "Compound",
      "videoUrl": "https://player.vimeo.com/video/756787906?h=2820b88eaa&badge=0&autopause=0&player_id=0&app_id=58479",
      "imageUrl": "https://cdn.muscleandstrength.com/sites/all/themes/mnsnew/images/taxonomy/exercises/muscle-groups/full/Traps.jpg",
      "viewCount": 33800,
      "popularity": "low"
    },
    {
      "id": "traps-15",
      "name": "Trap Lacrosse Ball",
      "description": "Using a lacrosse ball to perform smr on your traps is a great way to warm up and cool down for your workout, especially if you plan to perform upper body exercises that require the traps to be more mobile. When you perform smr on the traps, or any muscle group for that matter, you alleviate some of the tension that is built up during the day and your workouts.",
      "targetBodyParts": [
        "Traps"
      ],
      "exerciseType": [
        "smr"
      ],
      "difficulty": "intermediate",
      "equipment": [
        "Lacrosse Ball"
      ],
      "steps": [
        "In a supine position, place the lacrosse ball directly underneath the base of the trap.",
        "Bridge your hips up to apply pressure into the lacrosse ball and roll back and forth. You can also move the arm overhead and across the body to “tack and floss” the trap and improve results.",
        "Roll slowly for 20-30 seconds, “tack and floss” for 5-10 repetitions, and repeat on the other side."
      ],
      "tips": [
        "The most important thing you can remember with any soft tissue work: KEEP BREATHING. Don’t hold your breath, you want to release tension, not generate it.",
        "Do not allow yourself to fall into overextension, keep tension through the abs.",
        "If you find a tender spot, pause for 5-6 seconds and focus on slow, deep breaths and try to relax.",
        "Performing SMR may be uncomfortable but that’s not an excuse to avoid it. It hurts because there may be physiological or neurological influences generating a pain response. The more you roll the better it’ll feel provided there’s no serious underlying mechanism.",
        "If you notice any burning, numbness, or tingling, keep moving past that area. It’s likely a nerve and pausing on it for any length of time would not be a good idea.",
        "If you find a sensitive spot, pause for a second and take the joint through flexion and extension. This a method of active release known as “tack and floss”."
      ],
      "contraindications": [
        "Traps injury",
        "Joint pain",
        "Acute pain during movement"
      ],
      "muscles": [
        "Traps"
      ],
      "alternatives": [
        "traps-11",
        "traps-18",
        "traps-19",
        "traps-25",
        "traps-1"
      ],
      "repetitions": 12,
      "sets": 3,
      "restBetweenSets": 60,
      "forceType": "Compression",
      "mechanics": "Isolation",
      "videoUrl": "https://www.youtube.com/embed/RcoaDM-yZ-s?rel=0",
      "imageUrl": "https://cdn.muscleandstrength.com/sites/all/themes/mnsnew/images/taxonomy/exercises/muscle-groups/full/Traps.jpg",
      "viewCount": 3900,
      "popularity": "low"
    },
    {
      "id": "traps-16",
      "name": "1 KB Kettlebell Sumo Deadlift High Pull",
      "description": "The 1 KB kettlebell sumo deadlift high pull is a variation of the clean and an exercise used primarily to target the muscles of the shoulders and traps. The 1 KB kettlebell sumo deadlift high pull is a combination exercise (combining a sumo deadlift with a high pull) and will target other muscles groups such as the upper back and hamstrings. High pulls are performed explosively, and since the traps respond well to explosive movements, will help with trap muscle growth. They also have a significant amount of application in sports-specific training where explosiveness is an important indicator for performance.",
      "targetBodyParts": [
        "Traps"
      ],
      "exerciseType": [
        "olympic weightlifting"
      ],
      "difficulty": "beginner",
      "equipment": [
        "Kettle Bells"
      ],
      "steps": [
        "Position the kettlebell between your legs and assume a wider than shoulder width stance (determined by your hip structure and limb length).",
        "Push your hips back and hinge forward until your torso is nearly parallel with the floor.",
        "Reach down and grasp the handle of the bell with both hands.",
        "Inhale, drop your hips, and keep the chest up tall.",
        "Drive through the whole foot and focus on pushing the floor away.",
        "As the kettlebell nears your hips and your legs lock out, shrug the shoulders and then pull aggressively with the arms.",
        "The kettlebell should rise to sternum level at the completion of the movement.",
        "As the kettlebell returns to the hip position, reverse the movement by pushing the hips back and hinging forward.",
        "Return the kettlebell to the floor, reset, and repeat for the desired number of repetitions."
      ],
      "tips": [
        "Stance width varies greatly depending upon the individual. Rather than spending too much time trying to calculate your ideal stance width, simply experiment and see what feels best on your hips in the long run while simultaneously allowing you to generate the most power. For some folks this will be a semi medium width (hybrid) position whereas for others their toes will very wide.",
        "The hips should be lower than the shoulders and you should be able to see the logo on the lifter’s shirt before they pull (i.e. “chest up”). The chest up cue is usually accomplished when the lats become locked in though so this cue is typically not needed if the lifter understands how to initiate the lats.",
        "Ideally the knees should be tracking out over the foot. If you find that you have trouble keeping this neutral knee position, focus on spreading the floor by trying to push your feet apart as you push into the floor. In other words, imagine there is a crack in the floor and you’re trying to spread it open by pushing your heels away from each other. This will help to activate your glutes more during the movement and stabilize the knee joint.",
        "Neck position is highly individual - Some prefer a neutral neck position (i.e. keeping the chin tucked throughout the lift) while others do well with looking slightly up. Here’s some factors to \"consider\":\n          If you’re someone who is more globally extended (i.e. athletic background), then you will likely be able to keep a neutral position more effectively by packing the chin.\n          On the opposite end of the spectrum, if you tend to be more flexion dominant (especially in your thoracic spine - upper back) then it would behoove you to look up slightly as this will drive more extension.\n          Experiment with each and see which one works best for your individual anatomy and biomechanics.",
        "If you’re someone who is more globally extended (i.e. athletic background), then you will likely be able to keep a neutral position more effectively by packing the chin.",
        "On the opposite end of the spectrum, if you tend to be more flexion dominant (especially in your thoracic spine - upper back) then it would behoove you to look up slightly as this will drive more extension.",
        "Experiment with each and see which one works best for your individual anatomy and biomechanics.",
        "Ideally you should cue and emphasize a vertical shin, especially in the sumo deadlift.",
        "Toe angle is highly individual - this will be dependent upon your hip anatomy. Experiment (toes slightly out or neutral) to see what feels best for you.",
        "Do NOT retract your shoulder blades. This is mechanically inefficient and a self limiting cue as it shortens the length of the arms thus requiring a larger range of motion.",
        "Make sure you wrap your thumbs around the kettlebell and don’t utilize a false grip. Squeeze the handle as tight as possible like you’re trying to leave an imprint of your fingerprints on the kettlebell.",
        "If you focus on keeping the weight entirely on the heels, you won’t be able to effectively recruit your quads at the beginning of the lift and thus you’ll be slow off the flow. So, to combat this, you should focus on driving through the whole foot - you want 3 points of contact: big toe, little toe, and heel."
      ],
      "contraindications": [
        "Traps injury",
        "Joint pain",
        "Acute pain during movement",
        "Recent surgery",
        "Severe cardiovascular issues (for heavy compound movements)"
      ],
      "muscles": [
        "Traps",
        "Abs",
        "Adductors",
        "Biceps",
        "Calves",
        "Glutes",
        "Hamstrings",
        "Quads",
        "Shoulders",
        "Upper Back"
      ],
      "alternatives": [
        "traps-28",
        "traps-29",
        "traps-8",
        "traps-23",
        "traps-24"
      ],
      "repetitions": 12,
      "sets": 3,
      "restBetweenSets": 60,
      "forceType": "Pull (Bilateral)",
      "mechanics": "Compound",
      "videoUrl": "https://www.youtube.com/embed/-VRgsXVURZM?rel=0",
      "imageUrl": "https://cdn.muscleandstrength.com/sites/all/themes/mnsnew/images/taxonomy/exercises/muscle-groups/full/Traps.jpg",
      "viewCount": 7700,
      "popularity": "low"
    },
    {
      "id": "traps-17",
      "name": "Behind-The-Back Barbell Shrug",
      "targetBodyParts": [
        "Traps"
      ],
      "exerciseType": [
        "strength"
      ],
      "difficulty": "beginner",
      "equipment": [
        "Barbell"
      ],
      "steps": [
        "Set up for the behind-the-back barbell shrug by loading up the weight you want to use on a straight bar or an Olympic bar.",
        "Stand facing away from the bar with your feet about shoulder width apart.",
        "Bending only at the knees, pick the barbell up off the floor behind your back. You may have a training partner assist you.",
        "Grasp the bar with an overhand grip, with your hands about shoulder width apart.",
        "Keeping the barbell close to your body, let your shoulders sag as far as possible. This is the starting position for the exercise.",
        "Slowly shrug your shoulders up as far as possible.",
        "Pause, and then slowly lower the barbell back to the starting position.",
        "Repeat for desired reps."
      ],
      "tips": [
        "Focus on lifting the weight with your traps and not your biceps.",
        "Pausing at the top of the barbell shrug makes the exercise more challenging and you\"ll get more out of it. Try and pause for a count of 1-3 at the top of each rep.",
        "There\"s no benefit to rolling your shoulders forward or back when you shrug. Just raise the barbell straight up and straight down."
      ],
      "contraindications": [
        "Traps injury",
        "Joint pain",
        "Acute pain during movement"
      ],
      "muscles": [
        "Traps"
      ],
      "alternatives": [
        "traps-2",
        "traps-3",
        "traps-4",
        "traps-7",
        "traps-20"
      ],
      "repetitions": 12,
      "sets": 3,
      "restBetweenSets": 60,
      "forceType": "Pull",
      "mechanics": "Isolation",
      "videoUrl": "https://player.vimeo.com/video/756787954?h=78ea1a82c8&badge=0&autopause=0&player_id=0&app_id=58479",
      "imageUrl": "https://cdn.muscleandstrength.com/sites/all/themes/mnsnew/images/taxonomy/exercises/muscle-groups/full/Traps.jpg",
      "viewCount": 92700,
      "popularity": "low"
    },
    {
      "id": "traps-18",
      "name": "Inverted Shrug",
      "description": "The inverted shrug is an exercise one can use to isolate the muscles of the traps. As opposed to targeting the upper traps, as most shrug variations tend to do, the inverted shrug emphasizes the use of the mid and lower trap area. It is important to train them all to have a well develop set of traps.",
      "targetBodyParts": [
        "Traps"
      ],
      "exerciseType": [
        "strength"
      ],
      "difficulty": "intermediate",
      "equipment": [
        "Bodyweight"
      ],
      "steps": [
        "Position the safeties just below waist height in a rack.",
        "Assume supine position on the ground just beneath the bar.",
        "Inhale and reach up to grab the bar with a double overhand grip.",
        "Pinch your shoulder blades together and exhale as you contract all of the musculature in your upper back.",
        "Slowly lower back to the starting position and repeat for the desired number of repetitions."
      ],
      "tips": [
        "The traps tend to respond well to high reps and explosive movements (e.g. snatch grip high pulls) so program your accessory work accordingly.",
        "Ensure you don’t allow the shoulder blades to elevate during this movement. Keep the traps quiet and allow the musculature within your upper back to do all the work.",
        "Don’t allow the head to jut forward excessively as you squeeze the rhomboids, this can put the neck in a compromised position and result in an injury.",
        "Adding a pause at the top of the movement can help to enhance the mind muscle connection."
      ],
      "contraindications": [
        "Traps injury",
        "Joint pain",
        "Acute pain during movement"
      ],
      "muscles": [
        "Traps",
        "Shoulders",
        "Upper Back"
      ],
      "alternatives": [
        "traps-11",
        "traps-25",
        "traps-1",
        "traps-3",
        "traps-9"
      ],
      "repetitions": 12,
      "sets": 3,
      "restBetweenSets": 60,
      "forceType": "Pull (Bilateral)",
      "mechanics": "Isolation",
      "videoUrl": "https://www.youtube.com/embed/QyTnXh0X6Oc?rel=0",
      "imageUrl": "https://cdn.muscleandstrength.com/sites/all/themes/mnsnew/images/taxonomy/exercises/muscle-groups/full/Traps.jpg",
      "viewCount": 7400,
      "popularity": "low"
    },
    {
      "id": "traps-19",
      "name": "Lying Cable Shrug",
      "targetBodyParts": [
        "Traps"
      ],
      "exerciseType": [
        "strength"
      ],
      "difficulty": "intermediate",
      "equipment": [
        "Cable"
      ],
      "steps": [
        "Set up for the lying cable shrug by attaching a straight bar to a low pulley cable machine.",
        "Select the amount of weight on the stack and lie down facing the machine with your feet about shoulder width apart. You can press your feet against the machine for stability.",
        "Grab the bar with an overhand grip (palms facing down), with your hands about shoulder width apart.",
        "Keeping the bar close to your body, let your shoulders sag as far as possible. This is the starting position for the exercise.",
        "Slowly shrug your shoulders up as far as possible.",
        "Pause, and then slowly lower the weight back to the starting position.",
        "Repeat for desired reps."
      ],
      "tips": [
        "Focus on lifting the weight with your traps and not your biceps.",
        "Pausing at the top of the cable shrug makes the exercise more challenging and you\"ll get more out of it. Try and pause for a count of 1-3 at the top of each rep.",
        "There\"s no benefit to rolling your shoulders forward or back when you shrug - that\"s a myth!",
        "Just raise the bar straight up and straight down."
      ],
      "contraindications": [
        "Traps injury",
        "Joint pain",
        "Acute pain during movement"
      ],
      "muscles": [
        "Traps"
      ],
      "alternatives": [
        "traps-20",
        "traps-30",
        "traps-4",
        "traps-6",
        "traps-7"
      ],
      "repetitions": 12,
      "sets": 3,
      "restBetweenSets": 60,
      "forceType": "Pull",
      "mechanics": "Isolation",
      "videoUrl": "https://player.vimeo.com/video/756787871?h=8ecb5a0486&badge=0&autopause=0&player_id=0&app_id=58479",
      "imageUrl": "https://cdn.muscleandstrength.com/sites/all/themes/mnsnew/images/taxonomy/exercises/muscle-groups/full/Traps.jpg",
      "viewCount": 14500,
      "popularity": "low"
    },
    {
      "id": "traps-2",
      "name": "Barbell Upright Row",
      "description": "The Barbell Upright Row is a compound exercise that primarily targets the shoulders, specifically the lateral deltoids, and the upper traps. It also engages the biceps and forearms. The movement involves lifting a barbell straight up along the body, leading with the elbows, and then lowering it back down. This exercise helps build shoulder strength, improve posture, and develop upper body muscle definition.",
      "targetBodyParts": [
        "Traps"
      ],
      "exerciseType": [
        "strength"
      ],
      "difficulty": "beginner",
      "equipment": [
        "Barbell"
      ],
      "steps": [
        "Stand with feet shoulder-width apart. Grip the barbell with hands about shoulder-width apart, palms facing your thighs.",
        "Hold the barbell firmly in front of your thighs. Stand tall, chest up, and shoulders back. This is the starting position.",
        "Lift the bar straight up along your body, leading with your elbows. Keep the bar close to your torso.",
        "Raise the bar around chest level, with your elbows higher than your wrists.",
        "Slowly lower the bar back to the starting position, maintaining control. This is one rep.",
        "Perform the desired number of repetitions, focusing on form and controlled movements."
      ],
      "tips": [
        "Keep your core tight for better stability and posture.",
        "Focus on lifting with your elbows, not your hands, to target the shoulders and traps.",
        "Use smooth, controlled movements to prevent injury."
      ],
      "contraindications": [
        "Traps injury",
        "Joint pain",
        "Acute pain during movement",
        "Recent surgery",
        "Severe cardiovascular issues (for heavy compound movements)"
      ],
      "muscles": [
        "Traps",
        "Biceps",
        "Shoulders"
      ],
      "alternatives": [
        "traps-5",
        "traps-6",
        "traps-14",
        "traps-17",
        "traps-3"
      ],
      "repetitions": 8,
      "sets": 3,
      "restBetweenSets": 60,
      "forceType": "Pull",
      "mechanics": "Compound",
      "videoUrl": "https://player.vimeo.com/video/760008475?badge=0&autopause=0&player_id=0&app_id=58479",
      "imageUrl": "https://cdn.muscleandstrength.com/sites/all/themes/mnsnew/images/taxonomy/exercises/muscle-groups/full/Traps.jpg",
      "viewCount": 3900000,
      "popularity": "high"
    },
    {
      "id": "traps-20",
      "name": "Seated Cable Shrug",
      "targetBodyParts": [
        "Traps"
      ],
      "exerciseType": [
        "strength"
      ],
      "difficulty": "beginner",
      "equipment": [
        "Cable"
      ],
      "steps": [
        "Set up for the seated cable shrug by attaching a V-bar to a low pulley cable machine.",
        "Select the amount of weight on the stack and sit down facing the machine with your feet about shoulder width apart. You can press your feet against the machine for stability.",
        "Grasp the bar with a neutral grip and keep your back straight.",
        "Keeping your arms out in front of your body, let your shoulders sag as far as possible. This is the starting position for the exercise.",
        "Slowly shrug your shoulders up as far as possible.",
        "Pause, and then slowly lower the weight back to the starting position.",
        "Repeat for desired reps."
      ],
      "tips": [
        "Focus on lifting the weight with your traps and not your biceps.",
        "Pausing at the top of the cable shrug makes the exercise more challenging and you\"ll get more out of it. Try and pause for a count of 1-3 at the top of each rep."
      ],
      "contraindications": [
        "Traps injury",
        "Joint pain",
        "Acute pain during movement"
      ],
      "muscles": [
        "Traps"
      ],
      "alternatives": [
        "traps-4",
        "traps-7",
        "traps-13",
        "traps-14",
        "traps-17"
      ],
      "repetitions": 12,
      "sets": 3,
      "restBetweenSets": 60,
      "forceType": "Pull",
      "mechanics": "Isolation",
      "videoUrl": "https://player.vimeo.com/video/756787924?h=b2099b1a45&badge=0&autopause=0&player_id=0&app_id=58479",
      "imageUrl": "https://cdn.muscleandstrength.com/sites/all/themes/mnsnew/images/taxonomy/exercises/muscle-groups/full/Traps.jpg",
      "viewCount": 42900,
      "popularity": "low"
    },
    {
      "id": "traps-21",
      "name": "Standing Calf Machine Shrug",
      "description": "The standing calf machine shrug is an exercise used to isolate the trapezius muscles. The standing calf machine shrug takes the need for grip strength out of the shrugging equation, so theoretically you could train the traps using at a greater intensity than you could by performing other shrug variations.",
      "targetBodyParts": [
        "Traps"
      ],
      "exerciseType": [
        "strength"
      ],
      "difficulty": "beginner",
      "equipment": [
        "Machine"
      ],
      "steps": [
        "Assume a standing position in a calf raise machine with your shoulders against the pad and knees bent.",
        "Inhale and stand up straight by extending the knees.",
        "Contract your traps into the shoulder pads to elevate the shoulders. Squeeze hard at the top and slowly lower the bar back to the starting position.",
        "Repeat for the desired number of repetitions."
      ],
      "tips": [
        "Looking slightly up while shrugging may enhance the contraction as traps help to control movement of the skull. This motion should be smooth and controlled, as a ballistic movement could result in a neck injury.",
        "The traps tend to respond well to high reps and explosive movements (e.g. snatch grip high pulls) so program your accessory work accordingly.",
        "Limit momentum and excessive jerking or bouncing of the weight. No one cares about how much you shrug.",
        "Don’t allow the head to jut forward excessively as you squeeze the traps, this can put the neck in a compromised position and result in an injury.",
        "Adding a pause at the top of the movement can help to enhance the mind muscle connection."
      ],
      "contraindications": [
        "Traps injury",
        "Joint pain",
        "Acute pain during movement"
      ],
      "muscles": [
        "Traps",
        "Shoulders",
        "Upper Back"
      ],
      "alternatives": [
        "traps-9",
        "traps-1",
        "traps-3",
        "traps-7",
        "traps-11"
      ],
      "repetitions": 12,
      "sets": 3,
      "restBetweenSets": 60,
      "forceType": "Pull (Bilateral)",
      "mechanics": "Isolation",
      "videoUrl": "https://www.youtube.com/embed/KFWT7sDjpqc?rel=0",
      "imageUrl": "https://cdn.muscleandstrength.com/sites/all/themes/mnsnew/images/taxonomy/exercises/muscle-groups/full/Traps.jpg",
      "viewCount": 7900,
      "popularity": "low"
    },
    {
      "id": "traps-22",
      "name": "Gittleson Shrug",
      "description": "The Gittleson shrug is an advanced variation of the dumbbell shrug used to build bigger trapezius muscles. The Gittleson shrug emphasizes the contraction of the upper trapezius muscle by isolating the muscle and working them unilaterally. You also get a slightly greater range of motion by performing the Gittleson shrug since you do bring your ear to both shoulders as you perform the exercise.",
      "targetBodyParts": [
        "Traps"
      ],
      "exerciseType": [
        "strength"
      ],
      "difficulty": "advanced",
      "equipment": [
        "Dumbbell"
      ],
      "steps": [
        "Assume a seated position on a flat bench with the a dumbbell at your sides.",
        "Hinge forward, inhale, and grab the dumbbell with a neutral grip.",
        "Sit up tall and ensure your spine remains neutral.",
        "Place your free hand behind on base of the bench and tilt your head towards the supporting arm.",
        "Contract the trap to elevate the shoulder of the arm holding the dumbbell. As you squeeze the trap, tilt the head to the same side to enhance the contraction.",
        "Repeat for the desired number of repetitions."
      ],
      "tips": [
        "The traps tend to respond well to high reps and explosive movements (e.g. snatch grip high pulls) so program your accessory work accordingly.",
        "Limit momentum and excessive jerking or bouncing of the weight. No one cares about how much you shrug.",
        "Don’t allow the head to jut forward excessively as you squeeze the traps, this can put the neck in a compromised position and result in an injury.",
        "Adding a pause at the top of the movement can help to enhance the mind muscle connection."
      ],
      "contraindications": [
        "Traps injury",
        "Joint pain",
        "Acute pain during movement"
      ],
      "muscles": [
        "Traps",
        "Shoulders",
        "Upper Back"
      ],
      "alternatives": [
        "traps-1",
        "traps-4",
        "traps-3",
        "traps-5",
        "traps-7"
      ],
      "repetitions": 12,
      "sets": 3,
      "restBetweenSets": 60,
      "forceType": "Pull (Unilateral)",
      "mechanics": "Isolation",
      "videoUrl": "https://www.youtube.com/embed/VoOoTtK5190?rel=0",
      "imageUrl": "https://cdn.muscleandstrength.com/sites/all/themes/mnsnew/images/taxonomy/exercises/muscle-groups/full/Traps.jpg",
      "viewCount": 9900,
      "popularity": "low"
    },
    {
      "id": "traps-23",
      "name": "Snatch Grip High Pull",
      "description": "The snatch grip high pull is a variation of the high pull and an exercise used primarily to target the muscles of the shoulders and traps. The snatch grip high pull is somewhat of a combination exercise (combining a snatch grip deadlift with an upright row) and will target other muscles groups such as the upper back and hamstrings. High pulls are performed explosively, and since the traps respond well to explosive movements, will help with trap muscle growth. They also have a significant amount of application in sports-specific training where explosiveness is an important indicator for performance.",
      "targetBodyParts": [
        "Traps"
      ],
      "exerciseType": [
        "olympic weightlifting"
      ],
      "difficulty": "intermediate",
      "equipment": [
        "Barbell"
      ],
      "steps": [
        "Setup with your feet in a shoulder width stance, toes pointed out slightly, and your hands in a snatch width grip.",
        "Dip slightly to the power position and allow the bar to slide down your thighs.",
        "Explosively jump straight up, shrug the bar aggressively, and then drive the elbows high.",
        "Repeat for the desired number of repetitions."
      ],
      "tips": [
        "Olympic lifting is about efficiency, not just brute strength.",
        "Ideally you want the movement to take place in a vertical fashion. Don’t think about pushing the hips forward, think up.",
        "Toe angle is highly individual - experiment to see what feels best for you.",
        "Drive through the whole foot - you want 3 points of contact: big toe, little toe, and heel."
      ],
      "contraindications": [
        "Traps injury",
        "Joint pain",
        "Acute pain during movement",
        "Recent surgery",
        "Severe cardiovascular issues (for heavy compound movements)"
      ],
      "muscles": [
        "Traps",
        "Abs",
        "Adductors",
        "Biceps",
        "Calves",
        "Glutes",
        "Hamstrings",
        "Quads",
        "Shoulders",
        "Upper Back"
      ],
      "alternatives": [
        "traps-8",
        "traps-24",
        "traps-27",
        "traps-29",
        "traps-6"
      ],
      "repetitions": 12,
      "sets": 3,
      "restBetweenSets": 60,
      "forceType": "Pull (Bilateral)",
      "mechanics": "Compound",
      "videoUrl": "https://www.youtube.com/embed/OdLx4mkcLN8?rel=0",
      "imageUrl": "https://cdn.muscleandstrength.com/sites/all/themes/mnsnew/images/taxonomy/exercises/muscle-groups/full/Traps.jpg",
      "viewCount": 10100,
      "popularity": "low"
    },
    {
      "id": "traps-24",
      "name": "Snatch Shrug",
      "description": "The snatch shrug is a combination movement that combines the snatch with the barbell shrug. The exercise is primarily used to target the muscles of the traps. The traps respond well to explosive exercises, making the snatch shrug an excellent option for those trying to build thicker traps.",
      "targetBodyParts": [
        "Traps"
      ],
      "exerciseType": [
        "olympic weightlifting"
      ],
      "difficulty": "intermediate",
      "equipment": [
        "Barbell"
      ],
      "steps": [
        "Position the bar over the knot on your shoelaces but not touching your shins.",
        "Setup with your feet in a shoulder width stance, toes pointed out slightly, and your hands in a snatch grip position.",
        "Drop your hips and drive the chest up while looking forward.",
        "Stand up tall by extending the knees and hips.",
        "Dip slightly by bending the knees and hinging at the hips.",
        "Explosively jump straight up and shrug the bar aggressively.",
        "Return to the starting position and repeat for the desired number of repetitions."
      ],
      "tips": [
        "Olympic lifting is about efficiency, not just brute strength.",
        "Utilize this exercise initially to learn how to generate vertical movement during the snatch. If your struggle with initiating the pull with the arms too early during the clean, this can help.",
        "Ideally you want the movement to take place in a vertical fashion. Don’t think about pushing the hips forward, think up.",
        "Toe angle is highly individual - experiment to see what feels best for you.",
        "Drive through the whole foot - you want 3 points of contact: big toe, little toe, and heel."
      ],
      "contraindications": [
        "Traps injury",
        "Joint pain",
        "Acute pain during movement",
        "Recent surgery",
        "Severe cardiovascular issues (for heavy compound movements)"
      ],
      "muscles": [
        "Traps",
        "Abs",
        "Adductors",
        "Biceps",
        "Calves",
        "Forearms",
        "Glutes",
        "Hamstrings",
        "Quads",
        "Shoulders",
        "Upper Back"
      ],
      "alternatives": [
        "traps-8",
        "traps-23",
        "traps-27",
        "traps-29",
        "traps-6"
      ],
      "repetitions": 12,
      "sets": 3,
      "restBetweenSets": 60,
      "forceType": "Pull (Bilateral)",
      "mechanics": "Compound",
      "videoUrl": "https://www.youtube.com/embed/afkmMhd16u4?rel=0",
      "imageUrl": "https://cdn.muscleandstrength.com/sites/all/themes/mnsnew/images/taxonomy/exercises/muscle-groups/full/Traps.jpg",
      "viewCount": 3800,
      "popularity": "low"
    },
    {
      "id": "traps-25",
      "name": "Overhead Barbell Shrug",
      "description": "The overhead barbell shrug is a variation of the barbell shrug and is an exercise used to target the trapezius muscle. The significant different in the exercise is it somewhat changes the shrug from a pulling exercise to a pushing exercise. By bringing the weight overhead during the overhead barbell shrug, you’ll be forced to push your traps up to move the weight as opposed to pulling them to move the weight.",
      "targetBodyParts": [
        "Traps"
      ],
      "exerciseType": [
        "strength"
      ],
      "difficulty": "intermediate",
      "equipment": [
        "Barbell"
      ],
      "steps": [
        "Unrack the bar in a front rack position and press overhead to lockout with a double overhand grip.",
        "Inhale and contract the traps to elevate the shoulders.",
        "Slowly lower the bar back to the starting position and repeat for the desired number of repetitions."
      ],
      "tips": [
        "The traps tend to respond well to high reps and explosive movements (e.g. snatch grip high pulls) so program your accessory work accordingly.",
        "Limit momentum and excessive jerking or bouncing of the weight. No one cares about how much you shrug.",
        "Don’t allow the head to jut forward excessively as you squeeze the traps, this can put the neck in a compromised position and result in an injury.",
        "Adding a pause at the top of the movement can help to enhance the mind muscle connection."
      ],
      "contraindications": [
        "Traps injury",
        "Joint pain",
        "Acute pain during movement"
      ],
      "muscles": [
        "Traps",
        "Shoulders",
        "Upper Back"
      ],
      "alternatives": [
        "traps-3",
        "traps-11",
        "traps-18",
        "traps-26",
        "traps-1"
      ],
      "repetitions": 12,
      "sets": 3,
      "restBetweenSets": 60,
      "forceType": "Pull (Bilateral)",
      "mechanics": "Isolation",
      "videoUrl": "https://www.youtube.com/embed/GoFr73P8Xxs?rel=0",
      "imageUrl": "https://cdn.muscleandstrength.com/sites/all/themes/mnsnew/images/taxonomy/exercises/muscle-groups/full/Traps.jpg",
      "viewCount": 12100,
      "popularity": "low"
    },
    {
      "id": "traps-26",
      "name": "Snatch Grip Barbell Shrug",
      "description": "The snatch grip barbell shrug is a variation of the barbell shrug and an exercise used to isolate the traps. The main difference in a snatch grip barbell shrug is the hand placement used. By utilizing the wider than shoulder width hand placement, you’ll create slight more tension on the muscles of the traps. This is a great strategy to help build the traps as the traps are a muscle group that responds particularly well to time under tension.",
      "targetBodyParts": [
        "Traps"
      ],
      "exerciseType": [
        "strength"
      ],
      "difficulty": "beginner",
      "equipment": [
        "Barbell"
      ],
      "steps": [
        "Position the safeties just below waist height in a rack.",
        "Assume a standing position with the bar in front of your body.",
        "Hinge forward, inhale, and grab the bar well outside of shoulder width with a double overhand grip.",
        "Stand up tall and ensure your spine remains neutral.",
        "Contract the traps to elevate the shoulders. Squeeze hard at the top and slowly lower the bar back to the starting position.",
        "Repeat for the desired number of repetitions."
      ],
      "tips": [
        "Looking slightly up while shrugging may enhance the contraction as traps help to control movement of the skull. This motion should be smooth and controlled, as a ballistic movement could result in a neck injury.",
        "The traps tend to respond well to high reps and explosive movements (e.g. snatch grip high pulls) so program your accessory work accordingly.",
        "Limit momentum and excessive jerking or bouncing of the weight. No one cares about how much you shrug.",
        "Don’t allow the head to jut forward excessively as you squeeze the traps, this can put the neck in a compromised position and result in an injury.",
        "Adding a pause at the top of the movement can help to enhance the mind muscle connection."
      ],
      "contraindications": [
        "Traps injury",
        "Joint pain",
        "Acute pain during movement"
      ],
      "muscles": [
        "Traps",
        "Shoulders",
        "Upper Back"
      ],
      "alternatives": [
        "traps-3",
        "traps-1",
        "traps-9",
        "traps-12",
        "traps-13"
      ],
      "repetitions": 12,
      "sets": 3,
      "restBetweenSets": 60,
      "forceType": "Pull (Bilateral)",
      "mechanics": "Isolation",
      "videoUrl": "https://www.youtube.com/embed/wXB_491TC20?rel=0",
      "imageUrl": "https://cdn.muscleandstrength.com/sites/all/themes/mnsnew/images/taxonomy/exercises/muscle-groups/full/Traps.jpg",
      "viewCount": 11400,
      "popularity": "low"
    },
    {
      "id": "traps-27",
      "name": "Clean Shrug",
      "description": "The clean shrug is a combination movement that combines the clean with the barbell shrug. The exercise is primarily used to target the muscles of the traps. The traps respond well to explosive exercises, making the clean shrug an excellent option for those trying to build thicker traps.",
      "targetBodyParts": [
        "Traps"
      ],
      "exerciseType": [
        "olympic weightlifting"
      ],
      "difficulty": "intermediate",
      "equipment": [
        "Barbell"
      ],
      "steps": [
        "Position the bar over the knot on your shoelaces but not touching your shins.",
        "Setup with your feet in a shoulder width stance, toes pointed out slightly, and your hands slightly wider than shoulder width.",
        "Drop your hips and drive the chest up while looking forward.",
        "Stand up tall by extending the knees and hips.",
        "Dip slightly by bending the knees and hinging at the hips.",
        "Explosively jump straight up and shrug the bar aggressively.",
        "Return to the hang position and repeat for the desired number of repetitions."
      ],
      "tips": [
        "Olympic lifting is about efficiency, not just brute strength.",
        "Utilize this exercise initially to learn how to generate vertical movement during the clean. If you struggle with initiating the pull with the arms too early during the clean, this can help.",
        "Ideally you want the movement to take place in a vertical fashion. Don’t think about pushing the hips forward, think up.",
        "Toe angle is highly individual - experiment to see what feels best for you.",
        "Drive through the whole foot - you want 3 points of contact: big toe, little toe, and heel."
      ],
      "contraindications": [
        "Traps injury",
        "Joint pain",
        "Acute pain during movement",
        "Recent surgery",
        "Severe cardiovascular issues (for heavy compound movements)"
      ],
      "muscles": [
        "Traps",
        "Abs",
        "Adductors",
        "Biceps",
        "Calves",
        "Forearms",
        "Glutes",
        "Hamstrings",
        "Quads",
        "Shoulders"
      ],
      "alternatives": [
        "traps-8",
        "traps-23",
        "traps-24",
        "traps-29",
        "traps-6"
      ],
      "repetitions": 12,
      "sets": 3,
      "restBetweenSets": 60,
      "forceType": "Pull (Bilateral)",
      "mechanics": "Compound",
      "videoUrl": "https://www.youtube.com/embed/_E_XmZkQAkA?rel=0",
      "imageUrl": "https://cdn.muscleandstrength.com/sites/all/themes/mnsnew/images/taxonomy/exercises/muscle-groups/full/Traps.jpg",
      "viewCount": 5300,
      "popularity": "low"
    },
    {
      "id": "traps-28",
      "name": "2 KB Kettlebell Sumo Deadlift High Pull",
      "description": "The 2 KB kettlebell sumo deadlift to high pull is a variation of the clean and an exercise used primarily to target the muscles of the shoulders and traps. The 2 kb kettlebell high pull is a combination exercise (combining a sumo deadlift with a high pull) and will target other muscles groups such as the upper back and hamstrings. High pulls are performed explosively, and since the traps respond well to explosive movements, will help with trap muscle growth. They also have a significant amount of application in sports-specific training where explosiveness is an important indicator for performance.",
      "targetBodyParts": [
        "Traps"
      ],
      "exerciseType": [
        "olympic weightlifting"
      ],
      "difficulty": "beginner",
      "equipment": [
        "Kettle Bells"
      ],
      "steps": [
        "Position the kettlebells between your legs and assume a wider than shoulder width stance (determined by your hip structure and limb length).",
        "Push your hips back and hinge forward until your torso is nearly parallel with the floor.",
        "Reach down and grasp the handles of the bells with both hands.",
        "Inhale, drop your hips, and keep the chest up tall.",
        "Drive through the whole foot and focus on pushing the floor away.",
        "As the kettlebells nears your hips and your legs lock out, shrug the shoulders and then pull aggressively with the arms.",
        "The kettlebells should rise to sternum level at the completion of the movement.",
        "As the kettlebells return to the hip position, reverse the movement by pushing the hips back and hinging forward.",
        "Return the kettlebells to the floor, reset, and repeat for the desired number of repetitions."
      ],
      "tips": [
        "Stance width varies greatly depending upon the individual. Rather than spending too much time trying to calculate your ideal stance width, simply experiment and see what feels best on your hips in the long run while simultaneously allowing you to generate the most power. For some folks this will be a semi medium width (hybrid) position whereas for others their toes will very wide.",
        "The hips should be lower than the shoulders and you should be able to see the logo on the lifter’s shirt before they pull (i.e. “chest up”). The chest up cue is usually accomplished when the lats become locked in though so this cue is typically not needed if the lifter understands how to initiate the lats.",
        "Ideally the knees should be tracking out over the foot. If you find that you have trouble keeping this neutral knee position, focus on spreading the floor by trying to push your feet apart as you push into the floor. In other words, imagine there is a crack in the floor and you’re trying to spread it open by pushing your heels away from each other. This will help to activate your glutes more during the movement and stabilize the knee joint.",
        "Neck position is highly individual - Some prefer a neutral neck position (i.e. keeping the chin tucked throughout the lift) while others do well with looking slightly up. Here’s some factors to \"consider\":\n          If you’re someone who is more globally extended (i.e. athletic background), then you will likely be able to keep a neutral position more effectively by packing the chin.\n          On the opposite end of the spectrum, if you tend to be more flexion dominant (especially in your thoracic spine - upper back) then it would behoove you to look up slightly as this will drive more extension.\n          Experiment with each and see which one works best for your individual anatomy and biomechanics.",
        "If you’re someone who is more globally extended (i.e. athletic background), then you will likely be able to keep a neutral position more effectively by packing the chin.",
        "On the opposite end of the spectrum, if you tend to be more flexion dominant (especially in your thoracic spine - upper back) then it would behoove you to look up slightly as this will drive more extension.",
        "Experiment with each and see which one works best for your individual anatomy and biomechanics.",
        "Ideally you should cue and emphasize a vertical shin, especially in the sumo deadlift.",
        "Toe angle is highly individual - this will be dependent upon your hip anatomy. Experiment (toes slightly out or neutral) to see what feels best for you.",
        "Do NOT retract your shoulder blades. This is mechanically inefficient and a self limiting cue as it shortens the length of the arms thus requiring a larger range of motion.",
        "Make sure you wrap your thumbs around the kettlebell and don’t utilize a false grip. Squeeze the handle as tight as possible like you’re trying to leave an imprint of your fingerprints on the kettlebell.",
        "If you focus on keeping the weight entirely on the heels, you won’t be able to effectively recruit your quads at the beginning of the lift and thus you’ll be slow off the flow. So, to combat this, you should focus on driving through the whole foot - you want 3 points of contact: big toe, little toe, and heel."
      ],
      "contraindications": [
        "Traps injury",
        "Joint pain",
        "Acute pain during movement",
        "Recent surgery",
        "Severe cardiovascular issues (for heavy compound movements)"
      ],
      "muscles": [
        "Traps",
        "Abs",
        "Adductors",
        "Biceps",
        "Calves",
        "Glutes",
        "Hamstrings",
        "Quads",
        "Shoulders",
        "Upper Back"
      ],
      "alternatives": [
        "traps-16",
        "traps-29",
        "traps-8",
        "traps-23",
        "traps-24"
      ],
      "repetitions": 12,
      "sets": 3,
      "restBetweenSets": 60,
      "forceType": "Pull (Bilateral)",
      "mechanics": "Compound",
      "videoUrl": "https://www.youtube.com/embed/wLm32q4q0ZM?rel=0",
      "imageUrl": "https://cdn.muscleandstrength.com/sites/all/themes/mnsnew/images/taxonomy/exercises/muscle-groups/full/Traps.jpg",
      "viewCount": 2800,
      "popularity": "low"
    },
    {
      "id": "traps-29",
      "name": "Sumo High Pull",
      "description": "The sumo stance high pull is a variation of the high pull and an exercise used primarily to target the muscles of the shoulders and traps. The sumo high pull is somewhat of a combination exercise (combining a sumo deadlift with an upright row) and will target other muscles groups such as the upper back and hamstrings. High pulls are performed explosively, and since the traps respond well to explosive movements, will help with trap muscle growth. They also have a significant amount of application in sports-specific training where explosiveness is an important indicator for performance.",
      "targetBodyParts": [
        "Traps"
      ],
      "exerciseType": [
        "olympic weightlifting"
      ],
      "difficulty": "beginner",
      "equipment": [
        "Barbell"
      ],
      "steps": [
        "Position the bar over the top of your shoelaces and assume a wide stance (determined by your hip structure and limb length).",
        "Push your hips back and hinge forward until your torso is nearly parallel with the floor.",
        "Reach down and grasp the bar using a shoulder width, double overhand grip.",
        "Inhale and pull up slightly on the bar while allowing your hips to drop in a seesaw fashion. This phenomenon is commonly referred to as “pulling the slack out of the bar”.",
        "As you drop the hips and pull up on the bar, set the lats (imagine you’re trying to squeeze oranges in your armpits) and ensure your armpits are positioned directly over the bar.",
        "Drive through the whole foot and focus on pushing the floor away.",
        "As the bar nears your hips and your legs lock out, shrug the shoulders and then pull aggressively with the arms.",
        "The bar should rise to sternum level at the completion of the movement.",
        "As the bar returns back to the hip position, reverse the movement by pushing the hips back and hinging forward.",
        "Return the bar to the floor, reset, and repeat for the desired number of repetitions."
      ],
      "tips": [
        "Stance width varies greatly depending upon the individual. Rather than spend too much time trying to calculate your ideal stance width, simply experiment and see what feels best on your hips in the long run while simultaneously allowing you to generate the most power. For some folks this will be a semi medium width (hybrid) position whereas for others their toes will almost be touching the plates.",
        "The sumo pull is slightly different than conventional as the goal is to “wedge” your hips into the bar and get them as close as possible.",
        "To prevent the bar from drifting away from the body, one should focus on squeezing their lats in order to keep the bar close and allow it to travel in a linear fashion. Use the cue: “squeeze oranges in your armpits”, “put your shoulder blades in your back pockets” (i.e. scapular depression) or “imagine you’re doing a straight arm pulldown”.",
        "The hips should be lower than the shoulders and you should be able to see the logo on the lifter’s shirt before they pull (i.e. “chest up”). The chest up cue is usually accomplished when the lats become locked in though so this cue is typically not needed if the lifter understands how to initiate the lats.",
        "Ideally the knees should be tracking out over the foot. If you find that you have trouble keeping this neutral knee position, focus on spreading the floor by trying to push your feet apart as you push into the floor. In other words, imagine there is a crack in the floor and you’re trying to spread it open by pushing your heels away from each other. This will help to activate your glutes more during the movement and stabilize the knee joint.",
        "You MUST keep the crease of the armpit over the bar and the midfoot to allow the bar to travel linearly.",
        "Neck position is highly individual - Some prefer a neutral neck position (i.e. keeping the chin tucked throughout the lift) while others do well with looking slightly up. Here’s some factors to \"consider\":\n          If you’re someone who is more globally extended (i.e. athletic background), then you will likely be able to keep a neutral position more effectively by packing the chin.\n          On the opposite end of the spectrum, if you tend to be more flexion dominant (especially in your thoracic spine - upper back) then it would behoove you to look up slightly as this will drive more extension.\n          Experiment with each and see which one works best for your individual anatomy and biomechanics.",
        "If you’re someone who is more globally extended (i.e. athletic background), then you will likely be able to keep a neutral position more effectively by packing the chin.",
        "On the opposite end of the spectrum, if you tend to be more flexion dominant (especially in your thoracic spine - upper back) then it would behoove you to look up slightly as this will drive more extension.",
        "Experiment with each and see which one works best for your individual anatomy and biomechanics.",
        "Ideally you should cue and emphasize a vertical shin, especially in the sumo deadlift.",
        "Toe angle is highly individual - this will be dependent upon your hip anatomy. Experiment (toes slightly out or neutral) to see what feels best for you.",
        "Do NOT retract your shoulder blades. This is mechanically inefficient and a self limiting cue as it shortens the length of the arms thus requiring a larger range of motion.",
        "Make sure you wrap your thumb around the bar and don’t utilize a false grip. Squeeze the bar as tight as possible like you’re trying to leave an imprint of your fingerprints on the bar.",
        "Scraping the shins isn’t always necessary in the deadlift. It may occur more frequently with sumo rather than conventional work but if you have the arm pits in the correct position (as noted above) then the bar should travel vertically and the shins will become vertical and move out of the way as the knees extend.",
        "If you focus on keeping the weight entirely on the heels, you won’t be able to effectively recruit your quads at the beginning of the lift and thus you’ll be slow off the flow. So, to combat this, you should focus on driving through the whole foot - you want 3 points of contact: big toe, little toe, and heel."
      ],
      "contraindications": [
        "Traps injury",
        "Joint pain",
        "Acute pain during movement",
        "Recent surgery",
        "Severe cardiovascular issues (for heavy compound movements)"
      ],
      "muscles": [
        "Traps",
        "Abs",
        "Adductors",
        "Biceps",
        "Calves",
        "Glutes",
        "Hamstrings",
        "Quads",
        "Shoulders",
        "Upper Back"
      ],
      "alternatives": [
        "traps-8",
        "traps-16",
        "traps-23",
        "traps-24",
        "traps-27"
      ],
      "repetitions": 12,
      "sets": 3,
      "restBetweenSets": 60,
      "forceType": "Pull (Bilateral)",
      "mechanics": "Compound",
      "videoUrl": "https://www.youtube.com/embed/U_8okzWkU7E?rel=0",
      "imageUrl": "https://cdn.muscleandstrength.com/sites/all/themes/mnsnew/images/taxonomy/exercises/muscle-groups/full/Traps.jpg",
      "viewCount": 3000,
      "popularity": "low"
    },
    {
      "id": "traps-3",
      "name": "Barbell Shrug",
      "description": "The barbell shrug is a great exercise for those looking to build their trap muscles. Heavy shrugs are a favorite among many professionals who use the exercise to build bigger traps. The shrug can be incorporated into your shoulder workouts, back workouts, upper body workouts, or full body workouts.",
      "targetBodyParts": [
        "Traps"
      ],
      "exerciseType": [
        "strength"
      ],
      "difficulty": "beginner",
      "equipment": [
        "Barbell"
      ],
      "steps": [
        "Position the safeties just below waist height in a rack.",
        "Assume a standing position with the bar in front of your body.",
        "Hinge forward, inhale, and grab the bar with a double overhand grip.",
        "Stand up tall and ensure your spine remains neutral.",
        "Contract the traps to elevate the shoulders. Squeeze hard at the top and slowly lower the bar back to the starting position.",
        "Repeat for the desired number of repetitions."
      ],
      "tips": [
        "Looking slightly up while shrugging may enhance the contraction as traps help to control movement of the skull. This motion should be smooth and controlled, as a ballistic movement could result in a neck injury.",
        "The traps tend to respond well to high reps and explosive movements (e.g. snatch grip high pulls) so program your accessory work accordingly.",
        "Limit momentum and excessive jerking or bouncing of the weight. No one cares about how much you shrug.",
        "Don’t allow the head to jut forward excessively as you squeeze the traps, this can put the neck in a compromised position and result in an injury.",
        "Adding a pause at the top of the movement can help to enhance the mind muscle connection."
      ],
      "contraindications": [
        "Traps injury",
        "Joint pain",
        "Acute pain during movement"
      ],
      "muscles": [
        "Traps",
        "Shoulders",
        "Upper Back"
      ],
      "alternatives": [
        "traps-26",
        "traps-1",
        "traps-9",
        "traps-12",
        "traps-13"
      ],
      "repetitions": 12,
      "sets": 3,
      "restBetweenSets": 60,
      "forceType": "Pull (Bilateral)",
      "mechanics": "Isolation",
      "videoUrl": "https://www.youtube.com/embed/6hNudn7Peco?rel=0",
      "imageUrl": "https://cdn.muscleandstrength.com/sites/all/themes/mnsnew/images/taxonomy/exercises/muscle-groups/full/Traps.jpg",
      "viewCount": 1700000,
      "popularity": "high"
    },
    {
      "id": "traps-30",
      "name": "Lying Cable Upright Row",
      "targetBodyParts": [
        "Traps"
      ],
      "exerciseType": [
        "strength"
      ],
      "difficulty": "intermediate",
      "equipment": [
        "Cable"
      ],
      "steps": [
        "Set up for the lying cable upright row by attaching a straight bar to a low pulley cable machine.",
        "Select the amount of weight on the stack and lie down facing the machine with your feet about shoulder width apart. You can press your feet against the machine for stability.",
        "Grasp the bar with an overhand grip (palms facing down), with your hands just inside shoulder width apart. Rest the bar on your thighs with a slight bend in your elbows. This is the starting position for the exercise.",
        "Keeping your back straight, lift the bar straight up while keeping it as close to your body as possible (you should pull the bar up to around chest height - almost touching your chin).",
        "Pause, and then slowly lower the bar back to the starting position.",
        "Repeat for desired reps."
      ],
      "tips": [
        "Focus on keeping your elbows higher than your forearms. The elbows push the motion.",
        "Keep your body fixed throughout the set. Don\"t lean forward as you lower the bar, and back as you raise it. Movement of the body makes the upright row easier, and you will not get the most out of it.",
        "Pause and squeeze the traps at the top of the movement, and then lower the bar really slowly if you want to add extra intensity to the exercise."
      ],
      "contraindications": [
        "Traps injury",
        "Joint pain",
        "Acute pain during movement",
        "Recent surgery",
        "Severe cardiovascular issues (for heavy compound movements)"
      ],
      "muscles": [
        "Traps",
        "Biceps"
      ],
      "alternatives": [
        "traps-6",
        "traps-14",
        "traps-19",
        "traps-2",
        "traps-5"
      ],
      "repetitions": 12,
      "sets": 3,
      "restBetweenSets": 60,
      "forceType": "Pull",
      "mechanics": "Compound",
      "videoUrl": "https://player.vimeo.com/video/756787886?h=68c9bf1a1d&badge=0&autopause=0&player_id=0&app_id=58479",
      "imageUrl": "https://cdn.muscleandstrength.com/sites/all/themes/mnsnew/images/taxonomy/exercises/muscle-groups/full/Traps.jpg",
      "viewCount": 45500,
      "popularity": "low"
    },
    {
      "id": "traps-4",
      "name": "Seated Dumbbell Shrug",
      "targetBodyParts": [
        "Traps"
      ],
      "exerciseType": [
        "strength"
      ],
      "difficulty": "beginner",
      "equipment": [
        "Dumbbell"
      ],
      "steps": [
        "Set up for the seated dumbbell shrug by choosing a pair of dumbbells and sitting with your back straight on a flat bench.",
        "Grasp the dumbbells with a neutral grip (palms facing in), with your hands down at your sides.",
        "Let your shoulders sag as far as possible. This is the starting position for the exercise.",
        "Slowly shrug your shoulders up as far as possible.",
        "Pause, and then slowly lower the dumbbells back to the starting position.",
        "Repeat for desired reps."
      ],
      "tips": [
        "Focus on lifting the weight with your traps and not your biceps.",
        "Pausing at the top of the dumbbell shrug makes the exercise more challenging and you\"ll get more out of it. Try and pause for a count of 1-3 at the top of each rep.",
        "There\"s no benefit to rolling your shoulders forward or back when you shrug - that\"s a myth! Just raise the weight straight up and straight down."
      ],
      "contraindications": [
        "Traps injury",
        "Joint pain",
        "Acute pain during movement"
      ],
      "muscles": [
        "Traps"
      ],
      "alternatives": [
        "traps-1",
        "traps-5",
        "traps-7",
        "traps-17",
        "traps-20"
      ],
      "repetitions": 12,
      "sets": 3,
      "restBetweenSets": 60,
      "forceType": "Pull",
      "mechanics": "Isolation",
      "videoUrl": "https://player.vimeo.com/video/756787846?h=51d0483703&badge=0&autopause=0&player_id=0&app_id=58479",
      "imageUrl": "https://cdn.muscleandstrength.com/sites/all/themes/mnsnew/images/taxonomy/exercises/muscle-groups/full/Traps.jpg",
      "viewCount": 234000,
      "popularity": "medium"
    },
    {
      "id": "traps-5",
      "name": "One-Arm Dumbbell Upright Row",
      "targetBodyParts": [
        "Traps"
      ],
      "exerciseType": [
        "strength"
      ],
      "difficulty": "beginner",
      "equipment": [
        "Dumbbell"
      ],
      "steps": [
        "Choose a dumbbell and stand with your feet around shoulder width apart.",
        "Grasp the dumbbell with an overhand grip (palms facing down) with your left hand and place it on your thigh.",
        "Your left hand should be just inside shoulder width and there should be a slight bend in your elbow.",
        "Lift the dumbbell straight up while keeping it as close to your body as possible. You should pull the dumbbell up to around chest height - nearly touching your chin.",
        "Pause, and then slowly lower the dumbbell back to the starting position.",
        "Repeat for desired reps and then repeat with your right arm."
      ],
      "tips": [
        "Focus on keeping your elbows higher than your forearms. The elbows push the motion.",
        "Keep your body fixed throughout the set. Don\"t lean forward as you lower the dumbbells, and back as you raise them. Movement of the body makes the upright row easier, and you will not get the most out of it.",
        "Pause and squeeze the traps at the top of the movement, and then lower the dumbbells really slowly if you want to add a bit of intensity to the exercise."
      ],
      "contraindications": [
        "Traps injury",
        "Joint pain",
        "Acute pain during movement",
        "Recent surgery",
        "Severe cardiovascular issues (for heavy compound movements)"
      ],
      "muscles": [
        "Traps",
        "Biceps"
      ],
      "alternatives": [
        "traps-2",
        "traps-4",
        "traps-14",
        "traps-1",
        "traps-6"
      ],
      "repetitions": 8,
      "sets": 3,
      "restBetweenSets": 60,
      "forceType": "Pull",
      "mechanics": "Compound",
      "videoUrl": "https://player.vimeo.com/video/756787860?h=e2c4785495&badge=0&autopause=0&player_id=0&app_id=58479",
      "imageUrl": "https://cdn.muscleandstrength.com/sites/all/themes/mnsnew/images/taxonomy/exercises/muscle-groups/full/Traps.jpg",
      "viewCount": 149000,
      "popularity": "medium"
    },
    {
      "id": "traps-6",
      "name": "Wide Grip Upright Row",
      "targetBodyParts": [
        "Traps"
      ],
      "exerciseType": [
        "strength"
      ],
      "difficulty": "intermediate",
      "equipment": [
        "Barbell"
      ],
      "steps": [
        "Load up a barbell with the weight you want to use and stand facing it with your feet around shoulder width apart.",
        "Grasp the barbell with an overhand grip, and hands slightly wider than shoulder width apart.",
        "Pick the bar up, bending at the knees and keeping your back straight.",
        "Keeping your back straight and eyes facing forwards, lift the bar straight up while keeping it as close to your body as possible (you should pull the bar up to around chest height - nearly touching your chin).",
        "Pause, and then slowly lower the bar back to the starting position.",
        "Repeat for desired reps."
      ],
      "tips": [
        "Focus on keeping your elbows higher than your forearms. The elbows push the motion.",
        "Keep your body fixed throughout the set. Don\"t lean forward as you lower the bar, and back as you raise it. Movement of the body makes the upright row easier, and you will not get the most out of it.",
        "Pause and squeeze the traps at the top of the movement, and then lower the bar really slowly if you want to add some intensity to the exercise."
      ],
      "contraindications": [
        "Traps injury",
        "Joint pain",
        "Acute pain during movement",
        "Recent surgery",
        "Severe cardiovascular issues (for heavy compound movements)"
      ],
      "muscles": [
        "Traps",
        "Lats",
        "Shoulders"
      ],
      "alternatives": [
        "traps-2",
        "traps-30",
        "traps-5",
        "traps-8",
        "traps-10"
      ],
      "repetitions": 8,
      "sets": 3,
      "restBetweenSets": 60,
      "forceType": "Pull",
      "mechanics": "Compound",
      "videoUrl": "https://player.vimeo.com/video/756787972?h=573d1419c7&badge=0&autopause=0&player_id=0&app_id=58479",
      "imageUrl": "https://cdn.muscleandstrength.com/sites/all/themes/mnsnew/images/taxonomy/exercises/muscle-groups/full/Traps.jpg",
      "viewCount": 226900,
      "popularity": "medium"
    },
    {
      "id": "traps-7",
      "name": "Smith Machine Shrug",
      "targetBodyParts": [
        "Traps"
      ],
      "exerciseType": [
        "strength"
      ],
      "difficulty": "beginner",
      "equipment": [
        "Machine"
      ],
      "steps": [
        "Set up for the smith machine shrug by loading up the weight you want to use on a smith machine.",
        "Stand facing the bar with your feet about shoulder width apart.",
        "Grab the bar with an overhand grip (palms facing down), with your hands about shoulder width apart. Bending at the knees only, pick the barbell up and release the safety.",
        "Keeping the barbell close to your body, let your shoulders sag as far as possible. This is the starting position for the exercise.",
        "Slowly shrug your shoulders up as far as possible.",
        "Pause, and then slowly lower the barbell back to the starting position.",
        "Repeat for desired reps."
      ],
      "tips": [
        "Focus on lifting the weight with your traps and not your biceps.",
        "Pausing at the top of the barbell shrug makes the exercise more challenging and you\"ll get more out of it. Try and pause for a count of 1-3 at the top of each rep.",
        "There\"s no benefit to rolling your shoulders forward or back when you shrug - that\"s a myth! Just raise the barbell straight up and straight down."
      ],
      "contraindications": [
        "Traps injury",
        "Joint pain",
        "Acute pain during movement"
      ],
      "muscles": [
        "Traps"
      ],
      "alternatives": [
        "traps-4",
        "traps-9",
        "traps-17",
        "traps-20",
        "traps-21"
      ],
      "repetitions": 12,
      "sets": 3,
      "restBetweenSets": 60,
      "forceType": "Pull",
      "mechanics": "Isolation",
      "videoUrl": "https://player.vimeo.com/video/756787942?h=f23d4144a3&badge=0&autopause=0&player_id=0&app_id=58479",
      "imageUrl": "https://cdn.muscleandstrength.com/sites/all/themes/mnsnew/images/taxonomy/exercises/muscle-groups/full/Traps.jpg",
      "viewCount": 152100,
      "popularity": "medium"
    },
    {
      "id": "traps-8",
      "name": "High Pull",
      "description": "The high pull is a variation of the clean and an exercise used primarily to target the muscles of the shoulders and traps. The high pull is somewhat of a combination exercise (combining a deadlift with an upright row) and will target other muscles groups such as the upper back and hamstrings. High pulls are performed explosively, and since the traps respond well to explosive movements, will help with trap muscle growth. They also have a significant amount of application in sports-specific training where explosiveness is an important indicator for performance.",
      "targetBodyParts": [
        "Traps"
      ],
      "exerciseType": [
        "olympic weightlifting"
      ],
      "difficulty": "intermediate",
      "equipment": [
        "Barbell"
      ],
      "steps": [
        "Setup with your feet in a shoulder width stance, toes pointed out slightly, and your hands in a slightly wider than shoulder width grip.",
        "Dip slightly to the power position and allow the bar to slide down your thighs.",
        "Explosively jump straight up, shrug the bar aggressively, and then drive the elbows high.",
        "Repeat for the desired number of repetitions."
      ],
      "tips": [
        "Olympic lifting is about efficiency, not just brute strength.",
        "Ideally you want the movement to take place in a vertical fashion. Don’t think about pushing the hips forward, think up.",
        "Toe angle is highly individual - experiment to see what feels best for you.",
        "Drive through the whole foot - you want 3 points of contact: big toe, little toe, and heel."
      ],
      "contraindications": [
        "Traps injury",
        "Joint pain",
        "Acute pain during movement",
        "Recent surgery",
        "Severe cardiovascular issues (for heavy compound movements)"
      ],
      "muscles": [
        "Traps",
        "Abs",
        "Adductors",
        "Biceps",
        "Calves",
        "Forearms",
        "Glutes",
        "Hamstrings",
        "Quads",
        "Shoulders",
        "Upper Back"
      ],
      "alternatives": [
        "traps-23",
        "traps-24",
        "traps-27",
        "traps-29",
        "traps-6"
      ],
      "repetitions": 12,
      "sets": 3,
      "restBetweenSets": 60,
      "forceType": "Pull (Bilateral)",
      "mechanics": "Compound",
      "videoUrl": "https://www.youtube.com/embed/GZzESjLoJUM?rel=0",
      "imageUrl": "https://cdn.muscleandstrength.com/sites/all/themes/mnsnew/images/taxonomy/exercises/muscle-groups/full/Traps.jpg",
      "viewCount": 30800,
      "popularity": "low"
    },
    {
      "id": "traps-9",
      "name": "Machine Shrug",
      "description": "The machine shrug is a variation of the barbell shrug used to strengthen the trapezius muscles One would use the machine shrug as a way to focus on isolating the traps. One can better isolate certain muscle groups with a machine due to its fixed movement pattern. The machine shrug is best added towards the end of your workout if you are training for hypertrophy, after you’ve used other more compound and explosive movements to work your traps.",
      "targetBodyParts": [
        "Traps"
      ],
      "exerciseType": [
        "strength"
      ],
      "difficulty": "beginner",
      "equipment": [
        "Machine"
      ],
      "steps": [
        "Assume a standing position in front of the shrug machine.",
        "Hinge forward and grasp both handles with a double overhand grip.",
        "Assume a standing position, inhale, and contract the traps to elevate the shoulders. Squeeze hard at the top and slowly lower the bar back to the starting position.",
        "Repeat for the desired number of repetitions."
      ],
      "tips": [
        "Looking slightly up while shrugging may enhance the contraction as traps help to control movement of the skull. This motion should be smooth and controlled, as a ballistic movement could result in a neck injury.",
        "The traps tend to respond well to high reps and explosive movements (e.g. snatch grip high pulls) so program your accessory work accordingly.",
        "Don’t allow the head to jut forward excessively as you squeeze the traps, this can put the neck in a compromised position and result in an injury.",
        "Adding a pause at the top of the movement can help to enhance the mind muscle connection."
      ],
      "contraindications": [
        "Traps injury",
        "Joint pain",
        "Acute pain during movement"
      ],
      "muscles": [
        "Traps",
        "Shoulders",
        "Upper Back"
      ],
      "alternatives": [
        "traps-21",
        "traps-1",
        "traps-3",
        "traps-7",
        "traps-11"
      ],
      "repetitions": 12,
      "sets": 3,
      "restBetweenSets": 60,
      "forceType": "Pull (Bilateral)",
      "mechanics": "Isolation",
      "videoUrl": "https://www.youtube.com/embed/1xRJYoiUu-8?rel=0",
      "imageUrl": "https://cdn.muscleandstrength.com/sites/all/themes/mnsnew/images/taxonomy/exercises/muscle-groups/full/Traps.jpg",
      "viewCount": 14700,
      "popularity": "low"
    }
  ]
}