{
  "bodyPart": "Forearms",
  "exercises": [
    {
      "id": "forearms-1",
      "name": "Manual Håndleddscurl",
      "description": "Manual håndleddscurl er en isolasjonsøvelse som styrker underarmens fleksorer, spesielt flexor carpi radialis og flexor digitorum. I denne varianten hviler underarmen på en flat benk med håndflaten opp og håndleddet hengende utenfor kanten. Håndleddet bøyes opp for å løfte manualen og senkes deretter kontrollert tilbake til startposisjon. Øvelsen er en grunnpilar for å bygge grepsstyrke, forbedre håndleddsstabilitet og forebygge belastningsskader.",
      "steps": [
        "Sitt på en benk med føttene flatt i gulvet.",
        "Hold en manual i hånden og la underarmen hvile på benken med håndleddet hengende utenfor kanten og håndflaten opp.",
        "Start med håndleddet fullt strukket slik at manualen ruller ned mot fingertuppene.",
        "Bøy håndleddet opp så langt som mulig mens underarmen ligger stille på benken.",
        "Pause kort på toppen og klem underarmsmusklene.",
        "Senk manualen sakte tilbake til startposisjon og la underarmen få full strekk.",
        "Fullfør alle repetisjonene med én arm før du bytter."
      ],
      "tips": [
        "Hold underarmen helt støttet og i ro gjennom hele bevegelsen.",
        "Bruk full bevegelsesbane ved å la manualen rulle mot fingrene i bunnposisjon.",
        "Unngå momentum; løft kontrollert.",
        "Fokuser på å klemme underarmen på toppen av hver repetisjon.",
        "Start med lett vekt til du mestrer bevegelsen.",
        "Reduser vekten eller kontroller teknikken dersom du kjenner smerte i håndleddet.",
        "For økt intensitet kan du holde den kontraherte posisjonen i 1–2 sekunder før du senker.",
        "Sørg for sikkert, men ikke overdrevent, grep for å bevare bevegelsesutslaget."
      ],
      "targetBodyParts": ["Forearms"],
      "exerciseType": ["strength"],
      "difficulty": "beginner",
      "equipment": ["Dumbbell", "Bench"],
      "contraindications": [
        "Wrist injury or pain",
        "Carpal tunnel syndrome",
        "Recent forearm injury",
        "Elbow tendonitis"
      ],
      "muscles": ["Forearms", "Grip"],
      "alternatives": [],
      "repetitions": 15,
      "sets": 3,
      "restBetweenSets": 60,
      "forceType": "Pull (Unilateral)",
      "mechanics": "Isolation",
      "videoUrl": "gs://musco-dc111.firebasestorage.app/exercise_videos/IMG_4735.MOV",
      "imageUrl": "https://cdn.muscleandstrength.com/sites/all/themes/mnsnew/images/taxonomy/exercises/muscle-groups/full/Forearms.jpg",
      "viewCount": 0,
      "popularity": "medium"
    },
    {
      "id": "forearms-2",
      "name": "Manual Håndleddsrotasjon",
      "description": "Dette er en rotasjonsøvelse for underarmen der en manual holdes vertikalt i enden av håndtaket. Den trener primært pronatorene og supinatorene i underarmen samt musklene som styrer radial og ulnar deviasjon i håndleddet. Med underarmen støttet på en benk og håndleddet fritt, roteres manualen sakte og kontrollert gjennom buen sin mot gravitasjonsmomentet. Bevegelsen er avgjørende for å styrke rotasjonsstabiliteten i håndledd og albue, noe som er nyttig i idrett, løfting og skadeforebygging.",
      "steps": [
        "Sitt på en benk med føttene flatt i gulvet.",
        "Hold en lett manual vertikalt i den ene enden, og la underarmen hvile på benken med håndleddet hengende utenfor kanten.",
        "Hold overarmen i ro og albuen bøyd cirka 90 grader.",
        "Start med håndflaten vendt innover og roter håndleddet sakte til håndflaten vender opp (supinasjon).",
        "Fortsett rolig og kontroller bevegelsen til håndflaten vender ned (pronasjon).",
        "Beveg deg gjennom hele rotasjonsutslaget så langt det er komfortabelt.",
        "Om ønskelig kan du vippe håndleddet side til side for radial og ulnar deviasjon.",
        "Fullfør alle repetisjonene med én arm før du bytter."
      ],
      "tips": [
        "Beveg deg langsomt og unngå rykk eller overrotasjon.",
        "Hold albuen og underarmen låst for å isolere håndleddet.",
        "La manualens vektarm gjøre jobben – bruk ikke for tung belastning.",
        "Legg vekt på jevn overgang og kontroll i begge retninger.",
        "Start med svært lett vekt; øvelsen krever mindre motstand enn du kanskje tror.",
        "Prioriter bevegelseskvalitet fremfor høyt repetisjonstall.",
        "Stopp dersom du opplever smerte og ikke bare motstand.",
        "Hold håndleddet nøytralt når du ikke aktivt roterer."
      ],
      "targetBodyParts": ["Forearms"],
      "exerciseType": ["strength", "rehabilitation"],
      "difficulty": "beginner",
      "equipment": ["Dumbbell", "Bench"],
      "contraindications": [
        "Wrist injury or pain",
        "Recent forearm fracture",
        "Carpal tunnel syndrome",
        "Tennis or golfer's elbow",
        "Recent surgery to wrist or forearm"
      ],
      "muscles": ["Forearms", "Wrist Pronators", "Wrist Supinators"],
      "alternatives": ["forearms-1"],
      "repetitions": 10,
      "sets": 2,
      "restBetweenSets": 60,
      "forceType": "Pull (Unilateral)",
      "mechanics": "Isolation",
      "videoUrl": "gs://musco-dc111.firebasestorage.app/exercise_videos/IMG_4736.MOV",
      "imageUrl": "https://cdn.muscleandstrength.com/sites/all/themes/mnsnew/images/taxonomy/exercises/muscle-groups/full/Forearms.jpg",
      "viewCount": 0,
      "popularity": "low"
    },
    {
      "id": "forearms-3",
      "name": "Isometrisk Håndleddsekstensjon Hold (Uten Utstyr)",
      "description": "En skånsom isometrisk hold for håndleddsekstensorene som kan gjøres hjemme uten utstyr. Plasser underarmen på låret eller et bord, sett håndleddet i lett ekstensjon og hold jevnt spenn med avslappet skulder og nakke.",
      "steps": [
        "Sitt med underarmen støttet på lår eller bord og håndflaten vendt ned.",
        "Løft håndryggen lett opp i ekstensjon, eventuelt med hjelp fra den andre hånden.",
        "Hold posisjonen rolig med lett til moderat innsats og jevn pust.",
        "Hold albue og skulder stabile gjennom holdet.",
        "Senk rolig og gjenta."
      ],
      "tips": [
        "Hold smerte mild og stabil under holdet.",
        "Unngå hard klemming i fingrene.",
        "Bruk kortere hold hvis symptomene øker neste morgen.",
        "Fokuser på jevn spenning fremfor maksimal innsats."
      ],
      "targetBodyParts": ["Forearms"],
      "exerciseType": ["rehabilitation", "isometric"],
      "difficulty": "beginner",
      "equipment": ["Bodyweight"],
      "contraindications": [
        "Acute wrist injury",
        "Sharp radiating pain",
        "Recent forearm surgery"
      ],
      "muscles": ["Forearms", "Wrist Extensors"],
      "alternatives": ["forearms-1"],
      "repetitions": 1,
      "sets": 4,
      "restBetweenSets": 60,
      "forceType": "Isometric",
      "mechanics": "Isolation",
      "videoUrl": "",
      "imageUrl": "",
      "viewCount": 0,
      "popularity": "medium"
    },
    {
      "id": "forearms-4",
      "name": "Selvresistert Underarmsrotasjon (Uten Utstyr)",
      "description": "Kontrollert pronasjon/supinasjon med lett motstand fra motsatt hånd. Øvelsen bygger rotasjonstoleranse i håndledd og albue uten manual eller benk.",
      "steps": [
        "Bøy albuen omtrent 90 grader og hold den inntil kroppen.",
        "Bruk motsatt hånd til å gi lett motstand mens du roterer underarmen håndflate opp.",
        "Snu rolig tilbake med samme lette motstand til håndflate ned.",
        "Beveg deg sakte i smertefri bane med rolig skulder og overkropp.",
        "Gjenta kontrollerte repetisjoner på hver side."
      ],
      "tips": [
        "Start med svært lett motstand.",
        "Hold jevn, kontrollert bevegelse uten rykk.",
        "Hold deg i smertekontrollert bevegelsesutslag.",
        "Stopp ved skarp eller utstrålende smerte."
      ],
      "targetBodyParts": ["Forearms"],
      "exerciseType": ["rehabilitation", "mobility"],
      "difficulty": "beginner",
      "equipment": ["Bodyweight"],
      "contraindications": [
        "Acute wrist or elbow injury",
        "Recent fracture",
        "Sharp neurologic pain"
      ],
      "muscles": ["Forearms", "Wrist Pronators", "Wrist Supinators"],
      "alternatives": ["forearms-2"],
      "repetitions": 12,
      "sets": 2,
      "restBetweenSets": 45,
      "forceType": "Rehabilitation",
      "mechanics": "Isolation",
      "videoUrl": "",
      "imageUrl": "",
      "viewCount": 0,
      "popularity": "medium"
    }
  ]
}
