{
  "bodyPart": "Upper Legs",
  "exercises": [
    {
      "id": "hamstrings-2",
      "name": "Konvensjonell Markløft",
      "description": "Markløft er en svært populær øvelse og en sann test av total kroppsstyrke. Den benyttes av kroppsbyggere, styrkeløftere og CrossFit-utøvere. Markløften handler om å løfte død vekt fra gulvet til hoftehøyde uten å bruke momentum. Den er én av de «tre store» i styrkeløft sammen med knebøy og benkpress. Kroppsbyggere bruker markløft for å stimulere hele den bakre kjeden. Øvelsen aktiverer først og fremst hamstrings, men involverer også rygg, setemuskler, armer og kjerne. Konvensjonell markløft krever teknikk og ferdighet, men hoftehengs-mønsteret den trener bør inngå i ethvert program. Kan du ikke trekke konvensjonelt, finnes mange varianter som trap-bar-markløft, rumensk markløft, stiff-leg-markløft, landmine-markløft, manual-markløft og smith-maskin-markløft. God grepstyrke er essensielt, og vanlige grep er overhåndsgrep, miksgrep og hook-grep.",
      "steps": [
        "Plasser stangen over skolissene og ta hoftebredt fotfeste.",
        "Skyv hoftene bakover og hinge frem til overkroppen er nesten parallell med gulvet.",
        "Grip stangen skulderbredt med dobbelt overhåndsgrep.",
        "Inhaler og trekk lett i stangen mens hoftene synker i en vippebevegelse for å «ta slarken» ut av stangen.",
        "Når hoftene synker og du trekker i stangen, sett latsene ved å «knuse appelsiner i armhulene» og plasser armhulen rett over stangen.",
        "Press gjennom hele foten og «skyv gulvet bort».",
        "La stangen gå i rett linje mens knær og hofter strekkes.",
        "Når hoftene er låst ut, reverser ved å skyve hoftene bak og hinge frem.",
        "Sett stangen ned, re-set og gjenta ønsket antall repetisjoner."
      ],
      "tips": [
        "Hold armhulefolden over stangen og midtfoten slik at stangen kan bevege seg lineært.",
        "Markløft er et hinge, ikke en knebøy. For lav hofteposisjon gir dårlig biomekanikk.",
        "Klem latsene for å hindre at stangen driver fra kroppen – tenk «klem appelsiner», «skuldrene i baklommene» eller «strak arm-pulldown».",
        "Hoftene bør være lavere enn skuldrene, og logoen på brystet synlig før løftet.",
        "Nakkeposisjon er individuell. Test både nøytral hake og lett blikk opp for å se hva som passer din biomekanikk.",
        "Sikt på vertikale legger, men dette avhenger av bein- og rygglengde.",
        "Tåstilling er individuell; prøv lett inn, nøytral eller ut og se hva som føles best.",
        "Ikke retraher skulderbladene – det forkorter armene og øker løftebanen.",
        "Bruk helhetlig fottrykk: stortå, lilletå og hæl.",
        "Hold albuene strake for å unngå bicepsbelastning.",
        "Er du svak i toppen, bruk rack pulls, RDL eller band/kjetting. Er du svak fra gulvet, bruk pauseløft eller deficit-løft."
      ],
      "targetBodyParts": ["Hamstrings"],
      "exerciseType": ["strength"],
      "difficulty": "intermediate",
      "equipment": ["Barbell"],
      "contraindications": [
        "Hamstrings injury",
        "Joint pain",
        "Acute pain during movement",
        "Recent surgery",
        "Severe cardiovascular issues (for heavy compound movements)"
      ],
      "muscles": [
        "Hamstrings",
        "Abs",
        "Adductors",
        "Calves",
        "Forearms",
        "Glutes",
        "Hamstrings",
        "Lats",
        "Lower Back",
        "Middle Back",
        "Quads",
        "Traps",
        "Upper Back"
      ],
      "alternatives": ["hamstrings-5", "hamstrings-34"],
      "repetitions": 8,
      "sets": 3,
      "restBetweenSets": 60,
      "forceType": "Hinge (Bilateral)",
      "mechanics": "Compound",
      "videoUrl": "gs://musco-dc111.firebasestorage.app/exercise_videos/IMG_3001.MOV",
      "imageUrl": "https://cdn.muscleandstrength.com/sites/all/themes/mnsnew/images/taxonomy/exercises/muscle-groups/full/Hamstrings.jpg",
      "viewCount": 5100000,
      "popularity": "high"
    },
    {
      "id": "hamstrings-5",
      "name": "Rumensk Markløft (RDL)",
      "description": "Rumensk markløft er en variant av konvensjonell markløft og retter seg primært mot hamstrings og setemuskler. Selv om alle hoftehengs bevegelser treffer hamstrings, er RDL lenge blitt sett på som «beindeadlift-varianten». En smart strategi er å gjøre RDL på beindag og en annen markløftvariant på rygg- eller pulledager. Hoftehengs er et grunnleggende mønster, så finn en variant du behersker og tren den jevnlig. RDL passer best i bein- eller helkroppsøkter.",
      "steps": [
        "Plasser stangen over skolissene og ta hoftebredt fotfeste.",
        "Grip stangen med dobbelt overhåndsgrep rett utenfor hoftene og reis deg opp til toppposisjon med hofter og knær strake.",
        "Start RDL ved å skyve hoftene bakover og hinge frem til stangen er like under knærne.",
        "Press gjennom hele foten og «skyv gulvet bort».",
        "Returner til startposisjon og gjenta ønsket antall repetisjoner."
      ],
      "tips": [
        "Bevegelsesutslaget bestemmes av mobilitet og evnen til å holde nøytral rygg. Ikke stå på plattform hvis du ikke kontrollerer hele banen.",
        "Bruk stropper eller hook-grep på tunge løft hvis grepet svikter.",
        "Nakkeposisjon er individuell – prøv både nøytral og lett blikk opp avhengig av ryggtype.",
        "La ikke stangen drive fra kroppen; den skal gli langs lårene på vei ned.",
        "Grip stangen hardt med tomlene rundt – unngå falskt grep.",
        "Hold vekten jevnt fordelt over hele foten; ikke la tærne løfte seg.",
        "Hold albuene strake for å minske risikoen for bicepskade."
      ],
      "targetBodyParts": ["Hamstrings"],
      "exerciseType": ["strength"],
      "difficulty": "beginner",
      "equipment": ["Barbell"],
      "contraindications": [
        "Hamstrings injury",
        "Joint pain",
        "Acute pain during movement",
        "Recent surgery",
        "Severe cardiovascular issues (for heavy compound movements)"
      ],
      "muscles": [
        "Hamstrings",
        "Abs",
        "Forearms",
        "Glutes",
        "Lats",
        "Lower Back",
        "Traps",
        "Upper Back"
      ],
      "alternatives": ["hamstrings-34", "hamstrings-2"],
      "repetitions": 8,
      "sets": 3,
      "restBetweenSets": 60,
      "forceType": "Hinge (Bilateral)",
      "mechanics": "Compound",
      "videoUrl": "gs://musco-dc111.firebasestorage.app/exercise_videos/IMG_3031.MOV",
      "imageUrl": "https://cdn.muscleandstrength.com/sites/all/themes/mnsnew/images/taxonomy/exercises/muscle-groups/full/Hamstrings.jpg",
      "viewCount": 1800000,
      "popularity": "high"
    },
    {
      "id": "hamstrings-20",
      "name": "Nordisk Hamstringscurl",
      "description": "Nordisk hamstringscurl er en svært effektiv eksentrisk øvelse hvor overkroppen senkes forover fra knestående mens hoftene holdes strake og ryggen nøytral. Anklene forankres under en stang, maskin eller av partner, og hamstrings bremser fallet i forlenget posisjon. Øvelsen øker eksentrisk styrke, reduserer hamstringskader og forbedrer sprintprestasjon.",
      "steps": [
        "Knel på en myk matte med anklene festet under en stang eller holdt av en partner.",
        "Plasser knærne hoftebredt og hold overkroppen oppreist med hoftene strake.",
        "Kryss armene over brystet eller hold dem langs siden.",
        "Senk kroppen forover så sakte som mulig uten å bøye i hoften.",
        "Bruk hamstrings til å kontrollere nedturen så lenge som mulig.",
        "Når du ikke lenger kan kontrollere, ta imot med hendene i gulvet.",
        "Press deg tilbake med armene eller dra deg opp med hamstrings dersom du er sterk nok.",
        "Gjenta foreskrevet antall repetisjoner."
      ],
      "tips": [
        "Hold hoftene strake; unngå knekk i livet.",
        "Senk deg så sakte og kontrollert som mulig.",
        "Bruk hendene som siste utvei for å ta imot.",
        "Øk vanskelighetsgrad ved å utvide bevegelsesutslaget før du legger til motstand.",
        "Oppretthold nøytral ryggrad hele tiden.",
        "Start med mindre bevegelse dersom du er ny til øvelsen.",
        "Bruk armene for å hjelpe tilbake hvis hamstrings ikke klarer opp-fasen."
      ],
      "targetBodyParts": ["Hamstrings"],
      "exerciseType": ["strength"],
      "difficulty": "advanced",
      "equipment": ["Bodyweight"],
      "contraindications": [
        "Hamstrings injury",
        "Knee injuries",
        "Acute pain during movement",
        "Hypertension (due to potential breath holding during the exercise)"
      ],
      "muscles": ["Hamstrings", "Glutes", "Abs", "Calves"],
      "alternatives": ["hamstrings-20", "hamstrings-5", "hamstrings-34"],
      "repetitions": 6,
      "sets": 3,
      "restBetweenSets": 90,
      "forceType": "Pull (Eccentric)",
      "mechanics": "Isolation",
      "videoUrl": "gs://musco-dc111.firebasestorage.app/exercise_videos/IMG_4730.mov",
      "imageUrl": "https://cdn.muscleandstrength.com/sites/all/themes/mnsnew/images/taxonomy/exercises/muscle-groups/full/Hamstrings.jpg",
      "viewCount": 0,
      "popularity": "medium"
    },
    {
      "id": "hamstrings-34",
      "name": "Stivbeinsmarkløft",
      "description": "Stivbeinsmarkløft er en variant av markløft som styrker hele baksiden, inkludert hamstrings, setemuskler, legger og rygg. Forskjellen fra konvensjonell markløft er at bena holdes nesten strake under eksentrisk fase, noe som øker hamstrings-strekket. Øvelsen kan brukes både til å bygge større hamstrings og til å styrke konvensjonell markløft.",
      "steps": [
        "Plasser stangen like under hoftehøyde i stativet og last ønsket vekt.",
        "Hinge frem og grip stangen med dobbelt overhåndsgrep skulderbredt.",
        "Reis deg opp og ta to skritt bak fra stativet.",
        "Med strake knær skyver du hoftene bakover og hing­er frem til stangen er like under kneskålen.",
        "Press gjennom hele foten og «skyv gulvet bort».",
        "Fullfør bevegelsen ved å klemme setet og bakover­tilte bekkenet.",
        "Reverser ved å skyve hoftene bak og hinge frem.",
        "Returner stangen til gulvet, reset og gjenta ønsket antall repetisjoner."
      ],
      "tips": [
        "Ryggen skal ikke runde. Beveg deg kun så langt du kan kontrollere med nøytral rygg.",
        "Selv om knærne er nesten låst, skal du ikke spenne quadriceps aktivt.",
        "Øvelsen ligner konvensjonell markløft, men med høyere hofter og vertikale legger.",
        "Start fra rack, ikke fra gulv, for å unngå mobilitetsproblemer.",
        "Bevegelsen skjer i hoften – ikke bøy ryggen.",
        "Nakkeposisjon er individuell; test både nøytral og lett blikk opp.",
        "Ikke trekk skulderbladene sammen; det er unødvendig.",
        "Grip stangen hardt, tomlene rundt, og la stangen gli langs beina.",
        "Hold vekten over hele foten – tre kontaktpunkter.",
        "Hold albuene strake for å beskytte biceps."
      ],
      "targetBodyParts": ["Hamstrings"],
      "exerciseType": ["strength"],
      "difficulty": "intermediate",
      "equipment": ["Barbell"],
      "contraindications": [
        "Hamstrings injury",
        "Joint pain",
        "Acute pain during movement",
        "Recent surgery",
        "Severe cardiovascular issues (for heavy compound movements)"
      ],
      "muscles": [
        "Hamstrings",
        "Abs",
        "Adductors",
        "Calves",
        "Forearms",
        "Glutes",
        "Lats",
        "Lower Back",
        "Quads",
        "Traps",
        "Upper Back"
      ],
      "alternatives": ["hamstrings-5", "hamstrings-2"],
      "repetitions": 8,
      "sets": 3,
      "restBetweenSets": 60,
      "forceType": "Hinge (Bilateral)",
      "mechanics": "Compound",
      "videoUrl": "gs://musco-dc111.firebasestorage.app/exercise_videos/IMG_3030.mov",
      "imageUrl": "https://cdn.muscleandstrength.com/sites/all/themes/mnsnew/images/taxonomy/exercises/muscle-groups/full/Hamstrings.jpg",
      "viewCount": 8600,
      "popularity": "low"
    },
    {
      "id": "hamstrings-48",
      "name": "Ettbens Rumensk Markløft",
      "description": "Ettbens RDL er en unilateral øvelse for baksiden som trener hamstrings, setemuskler og støttemuskler i fot, ankel og kjerne. Ved å hinge i hoften mens det ene benet strekkes bakover og vekten senkes mot gulvet, utfordres balanse, kontroll og hamstrings i forlenget posisjon. Variasjonen er effektiv for å korrigere styrkeasymmetri, øke skade­motstand og forbedre hoftehengs-teknikk.",
      "steps": [
        "Stå oppreist med en vekt i høyre hånd (motsatt den arbeidende foten). Ved kroppsvekt kan armene strekkes for balanse.",
        "Flytt vekten til venstre fot og hold en lett knebøy.",
        "Hinge i hoften mens høyre ben strekkes rett bakover.",
        "Senk vekten mot gulvet tett inntil støttebenet.",
        "Senk til du kjenner strekk i hamstring med flat rygg.",
        "Press gjennom hælen, klem setet og returner til startposisjon.",
        "Fullfør alle repetisjoner før du bytter ben."
      ],
      "tips": [
        "Hold hoftene parallelle og flate mot gulvet.",
        "Bevar en rett linje fra hode til hæl på det bakre benet.",
        "La vekten følge støttebenet for balanse.",
        "Beveg deg sakte og kontrollert for maksimal spenning og stabilitet.",
        "Hinge i hoften – ikke bøy i livet.",
        "Hold kjernen aktiv for å stabilisere ryggen.",
        "Bruk vegg-støtte med frie fingertupper om balansen er utfordrende.",
        "Øvelsen kan utføres med manual, kettlebell, vektplate, stang eller kroppsvekt."
      ],
      "targetBodyParts": ["Hamstrings"],
      "exerciseType": ["strength"],
      "difficulty": "intermediate",
      "equipment": [
        "Kettlebell",
        "Dumbbell",
        "Weight Plate",
        "Barbell",
        "Bodyweight"
      ],
      "contraindications": [
        "Hamstrings injury",
        "Balance disorders",
        "Acute lower back pain",
        "Hip injury",
        "Ankle instability"
      ],
      "muscles": ["Hamstrings", "Glutes", "Lower Back", "Core", "Calves"],
      "alternatives": ["hamstrings-5", "hamstrings-34", "hamstrings-20"],
      "repetitions": 10,
      "sets": 3,
      "restBetweenSets": 60,
      "forceType": "Hinge (Unilateral)",
      "mechanics": "Compound",
      "videoUrl": "gs://musco-dc111.firebasestorage.app/exercise_videos/IMG_4731.mov",
      "imageUrl": "https://cdn.muscleandstrength.com/sites/all/themes/mnsnew/images/taxonomy/exercises/muscle-groups/full/Hamstrings.jpg",
      "viewCount": 0,
      "popularity": "medium"
    }
  ]
}
