{
  "bodyPart": "Upper Legs",
  "exercises": [
    {
      "id": "quads-1",
      "name": "Barbell Back Squat",
      "description": "The squat is the king of all exercises, working over 256 muscles in one movement! From bodybuilders to powerlifters to competitive athletes, the squat is a staple compound exercise and should be in every workout plan. For powerlifters, it is known as one of the “big three” lifts which includes the squat, deadlift, and bench press. For athletes, having an explosive squat is a good indicator for on field/court performance. And for bodybuilders, the squat is a compound exercise that targets nearly every muscle of your lower body and core. The squat directly targets the muscles of the quads, but also involves the hamstrings, glutes, back, and core as well as muscles of the shoulders and arms to a lesser degree. Not everyone is built to perform the traditional barbell back squat and it can result in some pain for certain individuals. Over the years, several squatting variations have been developed to help everyone be able to train this critical movement pattern safely. Some of the squat variations include: Bodyweight Squat Goblet Squat Landmine Squat Front Squat Dumbbell Squat Machine Hack Squat Smith Machine Squat The emphasis of the squat can be switched from the quads to the hamstrings by your foot placement. Some wear shoes with an elevated heel (or elevate their heels on plates) to focus more on the quads. Others keep a flat foot to put more pressure on the hamstrings. At the end of the day it is important that you pick a squat variation and foot placement that works best for you and that you can perform safely. Want to improve your squat? Try our 12 Week Super Squat Workout.",
      "targetBodyParts": [
        "Upper Legs"
      ],
      "exerciseType": [
        "strength"
      ],
      "difficulty": "intermediate",
      "equipment": [
        "Barbell"
      ],
      "steps": [
        "Set up for the exercise by setting the barbell to just below shoulder height and loading the weight you want to use.",
        "Stand under the bar with your feet at about shoulder width apart.",
        "Position the bar so that it is resting on the muscles on the top of your back, not on the back of your neck. The bar should feel comfortable. If it doesn\"t, try adding some padding to the bar.",
        "Now take your hands over the back and grip the bar with a wide grip for stability.",
        "You should now bend at the knees and straighten your back in preparation to take the weight off the rack.",
        "Keeping your back straight and eyes up, push up through the legs and take the weight off the rack.",
        "Take a small step back and stabilize yourself.",
        "Keeping your eyes facing forward slowly lower your body down. Don\"t lean forward as you come down. Your buttocks should come out and drop straight down.",
        "Squat down until your thighs are parallel with the floor, and then slowly raise your body back up by pushing through your heels.",
        "Do not lock the knees out when you stand up, and then repeat the movement."
      ],
      "tips": [
        "The are many mistakes that can be made when squatting, so it\"s important that you have your technique down before you attempt squatting heavy weights. If you are squatting correctly, you should not feel pain in your lower back. Lower back pain is usually a sign that you are not using correct form and/or your core is weak.",
        "Common mistakes when squatting: ",
        "Rounding the lower back: It\"s crucially important that you keep a straight back when you squat! You can ensure your back is straight by keeping your eyes facing forward, chest out, shoulder blades back, and back arched. Keep your core muscles tensed throughout the movement to help hold your back in place.",
        "Pushing from the balls of your feet: This puts unnecessary strain on joints and tendons. Always push up through your heels. Curling up your toes can help you get the technique right.",
        "Leaning forward: This happens when your hips move up faster than your shoulders. To prevent this keep the rep timing slow and controlled and stick your buttocks out as you go down.",
        "Knees come too far forward: When you squat down, your hips should be dropping straight down, not coming forward. Using a light weight, perfect your form standing side on to a mirror. Your knees should never track out and over your toes.",
        "Not squatting deep enough: Using squats to their full potential requires squatting down at least until your thighs are around parallel to the floor.",
        "Knees in or out: Don\"t point your knees in or out when you\"re lowering or pushing the weight. This puts unnecessary strain on the knee joints.",
        "Looking down: As soon as you look down your back rounds, simple as that."
      ],
      "contraindications": [
        "Upper Legs injury",
        "Joint pain",
        "Acute pain during movement",
        "Shoulder impingement",
        "Recent surgery",
        "Severe cardiovascular issues (for heavy compound movements)"
      ],
      "muscles": [
        "Upper Legs",
        "Calves",
        "Glutes",
        "Hamstrings",
        "Lower Back"
      ],
      "alternatives": [
        "quads-5",
        "quads-190",
        "quads-186"
      ],
      "repetitions": 8,
      "sets": 3,
      "restBetweenSets": 60,
      "forceType": "Push",
      "mechanics": "Compound",
      "videoUrl": "gs://musco-dc111.firebasestorage.app/exercise_videos/IMG_2999.MOV",
      "imageUrl": "https://cdn.muscleandstrength.com/sites/all/themes/mnsnew/images/taxonomy/exercises/muscle-groups/full/Upper Legs.jpg",
      "viewCount": 5100000,
      "popularity": "high"
    },
    {
      "id": "quads-4",
      "name": "Leg Extension",
      "description": "The seated leg extension is an isolation exercise and one used to target the muscles of the quads. This exercise can be particularly hard on the knees. So, for those with prior knee issues, it may be beneficial to stick with other movements, preferably compound, to target your quads. The leg extension is a great exercise for quad development and may be beneficial to include in your workout routines if your goals are more aesthetics-driven. The leg extension can be utilized in both leg workouts and full body workouts.",
      "targetBodyParts": [
        "Upper Legs"
      ],
      "exerciseType": [
        "strength"
      ],
      "difficulty": "beginner",
      "equipment": [
        "Machine"
      ],
      "steps": [
        "Select the desired resistance on the weight stack and insert the pin.",
        "Adjust the seat so that the knees are directly in line with the axis of the machine.",
        "Sit down and position your shins behind the pad at the base of the machine.",
        "Take a deep breath and extend your legs as you flex your quadriceps.",
        "As you lock out the knees, exhale to complete the repetition.",
        "Slowly lower your feet back to the starting position and repeat for the desired number of repetitions."
      ],
      "tips": [
        "Ensure the axis of rotation for the knee directly matches that of the machine. In other words, the point of rotation for the machine should be in line with your knee joint itself. If the knee is positioned too far in front or behind the axis of rotation, there will be excessive stress added to the joint which could cause significant injury.",
        "Typically extensions should not be done excessively heavy due to the lack of hamstring co-contraction with the quads. When one occurs in isolation it could present an injury risk to the knee if done with excessive weight.",
        "Pointing the toes can help to enhance mind muscle connection."
      ],
      "contraindications": [
        "Upper Legs injury",
        "Joint pain",
        "Acute pain during movement",
        "Shoulder impingement"
      ],
      "muscles": [
        "Upper Legs"
      ],
      "alternatives": [
        "quads-5",
        "quads-28",
        "quads-51"
      ],
      "repetitions": 12,
      "sets": 3,
      "restBetweenSets": 60,
      "forceType": "Push (Bilateral)",
      "mechanics": "Isolation",
      "videoUrl": "gs://musco-dc111.firebasestorage.app/exercise_videos/IMG_3011.mov",
      "imageUrl": "https://cdn.muscleandstrength.com/sites/all/themes/mnsnew/images/taxonomy/exercises/muscle-groups/full/Upper Legs.jpg",
      "viewCount": 3000000,
      "popularity": "high"
    },
    {
      "id": "quads-5",
      "name": "Leg Press",
      "description": "The leg press is a variation of the squat and an exercise used to target the muscles of the leg. One can utilize the leg press to target both the quads and the hamstring muscle, depending on which portion of the foot they push through. The leg press is commonly thought of as a machine variation of the barbell back squat. The mechanics are fairly similar, however, the leg press does not completely mimic the movement pattern of the squat. Nor does it work all of the muscle groups that the squat does. The leg press is best used as an accessory movement to the squat, or as a primary movement in gyms which lack the necessary equipment to train the squat movement pattern.",
      "targetBodyParts": [
        "Upper Legs"
      ],
      "exerciseType": [
        "strength"
      ],
      "difficulty": "beginner",
      "equipment": [
        "Machine"
      ],
      "steps": [
        "Load the machine with the desired weight and take a seat.",
        "Sit down and position your feet on the sled with a shoulder width stance.",
        "Take a deep breath, extend your legs, and unlock the safeties.",
        "Lower the weight under control until the legs are roughly 45 degrees or slightly below.",
        "Drive the weight back to the starting position by extending the knees but don't forcefully lockout.",
        "Repeat for the desired number of repetitions."
      ],
      "tips": [
        "To keep tension on the quads, keep the knees just shy of lockout.",
        "To emphasize the glutes more, push through the heels.",
        "To emphasize the quads more, push through the balls of the feet.",
        "Don't allow the hips to posteriorly tilt and roll off the pad.",
        "Keep your low back flat against the pad throughout the movement.",
        "Maintain a neutral head position by not looking up or down excessively.",
        "Self spotting is possible by simply applying pressure to the knees with the hands. Use only when necessary.",
        "Toe angle is individual and will depend upon each individual's hip anatomy and ankle mobility - experiment and adjust based upon feel."
      ],
      "contraindications": [
        "Upper Legs injury",
        "Joint pain",
        "Acute pain during movement",
        "Shoulder impingement",
        "Recent surgery",
        "Severe cardiovascular issues (for heavy compound movements)"
      ],
      "muscles": [
        "Upper Legs",
        "Abs",
        "Adductors",
        "Calves",
        "Glutes",
        "Hamstrings",
        "Lower Back"
      ],
      "alternatives": [
        "quads-1",
        "quads-4",
        "quads-190"
      ],
      "repetitions": 12,
      "sets": 3,
      "restBetweenSets": 60,
      "forceType": "Push (Bilateral)",
      "mechanics": "Compound",
      "videoUrl": "gs://musco-dc111.firebasestorage.app/exercise_videos/IMG_2991.MOV",
      "imageUrl": "https://cdn.muscleandstrength.com/sites/all/themes/mnsnew/images/taxonomy/exercises/muscle-groups/full/Upper Legs.jpg",
      "viewCount": 3100000,
      "popularity": "high"
    },
    {
      "id": "quads-28",
      "name": "Bodyweight Lunge",
      "description": "The bodyweight lunge is a lunge variation and an exercise used to strengthen the muscles of the legs including the quads, hamstrings, glutes, and calves. The lunge is a foundational movement pattern that should be incorporated into every workout program and trained fairly frequently. Those looking to add lunges into their own workout programs should follow the single leg sample progression scheme outlined in the notes below.",
      "targetBodyParts": [
        "Upper Legs"
      ],
      "exerciseType": [
        "strength"
      ],
      "difficulty": "beginner",
      "equipment": [
        "Bodyweight"
      ],
      "steps": [
        "Set up with your feet shoulder width apart.",
        "Step forward with one leg and allow both knees to bend simultaneously.",
        "Descend until the back knee touches the floor.",
        "Drive through the front foot and extend the knee as you stand up fully and return to the starting position.",
        "Repeat for the desired number of repetitions."
      ],
      "tips": [
        "Forward lunges are a more advanced progression and should only be utilized once one has the requisite hip and core stability. In general, a proper single leg progression scheme might look like \"this\":\n          Step Up\n          Split Squat > Front foot elevated\n          Reverse Lunge > Front foot elevated\n          Single Leg Squat to Bench\n          Lateral Lunge\n          Bulgarian/Rear Foot Elevated Split Squat (RFESS)\n          Single Leg Squat From Bench\n          Walking Lunge\n          Forward Lunge\n          Single Leg Skater Squat\n          Pistol Squat",
        "Step Up",
        "Split Squat > Front foot elevated",
        "Reverse Lunge > Front foot elevated",
        "Single Leg Squat to Bench",
        "Lateral Lunge",
        "Bulgarian/Rear Foot Elevated Split Squat (RFESS)",
        "Single Leg Squat From Bench",
        "Walking Lunge",
        "Forward Lunge",
        "Single Leg Skater Squat",
        "Pistol Squat",
        "Don't rush the progression scheme, earn the right to use every exercise and don't neglect any of them.",
        "When you go to push back to the starting position, fight the urge to lead the movement with your shoulders by hyperextending at your spine. Instead, look to drive the movement via force from your lower body.",
        "In the bottom of the movement both of your legs should be at 90 degree angles at the knees.",
        "Keep in mind that with any sort of lunge or split squat pattern, if you want to emphasize the quads, focus on taking a slightly smaller step and drive up through the ball of the foot.",
        "If you want to emphasize the glutes and hamstrings during any sort of lunge or split squat pattern, focus on taking a slightly larger step and drive up through the heel of the foot."
      ],
      "contraindications": [
        "Upper Legs injury",
        "Joint pain",
        "Acute pain during movement",
        "Shoulder impingement",
        "Recent surgery",
        "Severe cardiovascular issues (for heavy compound movements)"
      ],
      "muscles": [
        "Upper Legs",
        "Abs",
        "Adductors",
        "Calves",
        "Glutes",
        "Hamstrings"
      ],
      "alternatives": [
        "quads-186",
        "quads-192",
        "quads-51"
      ],
      "repetitions": 12,
      "sets": 3,
      "restBetweenSets": 60,
      "forceType": "Push (Unilateral)",
      "mechanics": "Compound",
      "videoUrl": "gs://musco-dc111.firebasestorage.app/exercise_videos/IMG_3129.mov",
      "imageUrl": "https://cdn.muscleandstrength.com/sites/all/themes/mnsnew/images/taxonomy/exercises/muscle-groups/full/Upper Legs.jpg",
      "viewCount": 215800,
      "popularity": "medium"
    },
    {
      "id": "quads-51",
      "name": "Single Leg Squat From Bench",
      "description": "The single leg squat from bench is a variation of the step up and an exercise used to strengthen the muscles of the leg. The single leg squat is an excellent exercise to use to help you progress along the single leg exercises progression spectrum. The exercise can help you build unilateral leg strength as well as help improve balance.",
      "targetBodyParts": [
        "Upper Legs"
      ],
      "exerciseType": [
        "strength"
      ],
      "difficulty": "intermediate",
      "equipment": [
        "Bench"
      ],
      "steps": [
        "Set up in a single leg stance position on a bench with one leg bent straight in front of you and the other supporting your bodyweight while keeping the knee slightly bent.",
        "Descend by flexing the knee of the supporting leg and continue until your foot touches the floor.",
        "Drive through the front foot and extend the knee as you return to the starting position.",
        "Repeat for the desired number of repetitions."
      ],
      "tips": [
        "Only touch the heel of the foot at the bottom of the movement, this helps to prevent a person from pushing off with their non supportive leg at the most difficult part of the movement.",
        "Ensure you keep the heel down on the bench and load the quads by allowing the knee to travel forward as you descend.",
        "Descend slowly and focus on controlling the movement via the quads rather than relying upon momentum.",
        "If you cannot complete repetitions at a normal bench height, simply work your way up in bench height over time.",
        "You can utilize a variety of different loading strategies with this exercises, everything from dumbbells in a goblet position to a landmine attachment and everything in between. However, initially I would recommend a counterbalanced approach with dumbbells as this will allow you to complete the exercise without much concern for the balance aspect."
      ],
      "contraindications": [
        "Upper Legs injury",
        "Joint pain",
        "Acute pain during movement",
        "Shoulder impingement",
        "Recent surgery",
        "Severe cardiovascular issues (for heavy compound movements)"
      ],
      "muscles": [
        "Upper Legs",
        "Abs",
        "Adductors",
        "Calves",
        "Glutes",
        "Hamstrings"
      ],
      "alternatives": [
        "quads-191",
        "quads-192",
        "quads-28"
      ],
      "repetitions": 12,
      "sets": 3,
      "restBetweenSets": 60,
      "forceType": "Push (Unilateral)",
      "mechanics": "Compound",
      "videoUrl": "gs://musco-dc111.firebasestorage.app/exercise_videos/IMG_3752.MOV",
      "imageUrl": "https://cdn.muscleandstrength.com/sites/all/themes/mnsnew/images/taxonomy/exercises/muscle-groups/full/Upper Legs.jpg",
      "viewCount": 20900,
      "popularity": "low"
    },
    {
      "id": "quads-186",
      "name": "Bodyweight Bulgarian Split Squat",
      "description": "No description available",
      "targetBodyParts": [
        "Upper Legs"
      ],
      "exerciseType": [
        "strength"
      ],
      "difficulty": "beginner",
      "equipment": [
        "Bodyweight"
      ],
      "steps": [
        "Set up for the one leg bodyweight squat by standing about 2-3 feet in front of a flat bench, facing away from the bench.",
        "Cross your arms across your chest for stability. Now carefully extend your right leg behind you and place the top of your foot securely on the bench.",
        "Keeping your eyes facing forwards slowly lower your body down by bending at the left knee.  Don\"t lean forward as you come down. Your buttocks should drop straight down.",
        "Squat down until your left thigh is parallel with the floor, and then slowly raise your body back up by pushing through your heel.",
        "Do not lock the knee out when you stand up.",
        "Repeat for desired reps and then repeat using your right leg.",
        "The same principals apply to the bodyweight squat as apply to the regular squat. Keep your back straight, eyes facing forwards, chest out, and don\"t let your knees come forward as you squat down."
      ],
      "tips": [
        "The same principals apply to the bodyweight squat as apply to the regular squat. Keep your back straight, eyes facing forwards, chest out, and don\"t let your knees come forward as you squat down."
      ],
      "contraindications": [
        "Upper Legs injury",
        "Joint pain",
        "Acute pain during movement",
        "Shoulder impingement",
        "Recent surgery",
        "Severe cardiovascular issues (for heavy compound movements)"
      ],
      "muscles": [
        "Upper Legs",
        "Calves",
        "Glutes",
        "Hamstrings"
      ],
      "alternatives": [
        "quads-28",
        "quads-191",
        "quads-192"
      ],
      "repetitions": 12,
      "sets": 3,
      "restBetweenSets": 60,
      "forceType": "Push",
      "mechanics": "Compound",
      "videoUrl": "gs://musco-dc111.firebasestorage.app/exercise_videos/IMG_3002.MOV",
      "imageUrl": "https://cdn.muscleandstrength.com/sites/all/themes/mnsnew/images/taxonomy/exercises/muscle-groups/full/Upper Legs.jpg",
      "viewCount": 16200,
      "popularity": "low"
    },
    {
      "id": "quads-190",
      "name": "Bodyweight Squat",
      "description": "The bodyweight squat is a fundamental movement pattern that forms the foundation of lower body strength training. This exercise requires no equipment, making it perfect for beginners learning proper squat form and for those working out at home. While less intensive than its weighted counterparts, the bodyweight squat effectively targets the muscles of the lower body while also engaging the core for stability. It's an excellent exercise for developing proper form, building basic strength, improving mobility, and preparing for more advanced squat variations.",
      "targetBodyParts": [
        "Upper Legs"
      ],
      "exerciseType": [
        "strength",
        "mobility"
      ],
      "difficulty": "beginner",
      "equipment": [
        "Bodyweight"
      ],
      "steps": [
        "Stand with your feet slightly wider than shoulder-width apart, toes pointed slightly outward.",
        "Keep your chest up, shoulders back, and core engaged.",
        "For balance, you can hold your arms straight out in front of you or keep them close to your chest.",
        "Initiate the movement by pushing your hips back, as if sitting into a chair.",
        "Bend your knees and lower your body, keeping your back straight and chest up.",
        "Lower yourself until your thighs are parallel to the ground, or as far as you can while maintaining proper form.",
        "Keep your weight in your heels and ensure your knees track in line with your toes.",
        "Push through your heels to return to the starting position, squeezing your glutes at the top.",
        "Repeat for the desired number of repetitions."
      ],
      "tips": [
        "Keep your eyes forward and head neutral throughout the movement.",
        "Maintain a straight back - avoid rounding your lower back or excessive forward lean.",
        "Push your knees out slightly as you descend to prevent them from caving inward.",
        "Breathe in as you lower down and exhale as you push back up.",
        "Focus on sitting back with your hips rather than pushing your knees forward.",
        "Keep your weight in your heels - you should be able to wiggle your toes at the bottom of the squat.",
        "Start with shorter ranges of motion if needed, gradually working toward full depth as mobility improves."
      ],
      "contraindications": [
        "Knee injury or pain",
        "Hip injury",
        "Acute lower back pain",
        "Severe ankle mobility restrictions",
        "Balance issues"
      ],
      "muscles": [
        "Upper Legs",
        "Glutes",
        "Calves",
        "Core"
      ],
      "alternatives": [
        "quads-1",
        "quads-5",
        "quads-28"
      ],
      "repetitions": 15,
      "sets": 3,
      "restBetweenSets": 45,
      "forceType": "Push",
      "mechanics": "Compound",
      "videoUrl": "gs://musco-dc111.firebasestorage.app/exercise_videos/IMG_3130.mov",
      "imageUrl": "https://cdn.muscleandstrength.com/sites/all/themes/mnsnew/images/taxonomy/exercises/muscle-groups/full/Upper Legs.jpg",
      "viewCount": 850000,
      "popularity": "high"
    },
    {
      "id": "quads-191",
      "name": "Assisted Pistol Squat",
      "description": "The Assisted Pistol Squat is a modified version of the challenging single-leg pistol squat, using external support like TRX straps, resistance bands, or a stable object to aid balance and reduce the load. This makes the movement accessible while developing the necessary strength, mobility, and control to progress towards the unassisted version.",
      "targetBodyParts": [
        "Upper Legs"
      ],
      "exerciseType": [
        "strength"
      ],
      "difficulty": "intermediate",
      "equipment": [
        "Bodyweight",
        "TRX",
        "Bands"
      ],
      "steps": [
        "Set up your chosen assistance: Hold TRX handles, secure a band overhead, or stand beside a stable support.",
        "Assume a single-leg stance, extending the non-working leg straight out in front.",
        "Holding the assistance lightly, initiate the squat by flexing the knee and hip of the supporting leg.",
        "Descend slowly, keeping your back straight and core engaged. Use the assistance as needed for balance and control, especially in the bottom position.",
        "Lower until your hamstring nears your calf, or as deep as mobility allows while maintaining good form.",
        "Drive through the heel of the supporting foot to ascend. Use minimal assistance from your arms/support to help push back up.",
        "Return to the starting single-leg stance.",
        "Complete reps on one side, then switch."
      ],
      "tips": [
        "Use only the minimum amount of assistance necessary to complete the rep with good form.",
        "Focus on controlling the descent and driving up primarily with your leg.",
        "To progress, gradually reduce reliance on the assistance (e.g., less pull on TRX/band, lighter touch on support). Aim for 8-12 reps per leg.",
        "Maintain core tension throughout the movement.",
        "Keep the heel of the supporting foot firmly on the ground.",
        "Ensure the knee of the supporting leg tracks in line with your foot.",
        "Work on ankle and hip mobility alongside this exercise."
      ],
      "contraindications": [
        "Upper Legs injury",
        "Significant knee or hip pain",
        "Acute pain during movement",
        "Severe balance impairments",
        "Poor ankle/hip mobility (address concurrently)"
      ],
      "muscles": [
        "Upper Legs",
        "Abs",
        "Adductors",
        "Calves",
        "Glutes",
        "Hamstrings"
      ],
      "alternatives": [
        "quads-51",
        "quads-192",
        "quads-186"
      ],
      "repetitions": 8,
      "sets": 3,
      "restBetweenSets": 75,
      "forceType": "Push (Unilateral)",
      "mechanics": "Compound",
      "videoUrl": "gs://musco-dc111.firebasestorage.app/exercise_videos/IMG_3748.MOV",
      "imageUrl": "https://cdn.muscleandstrength.com/sites/all/themes/mnsnew/images/taxonomy/exercises/muscle-groups/full/Upper Legs.jpg",
      "viewCount": 0,
      "popularity": "low"
    },
    {
      "id": "quads-192",
      "name": "Single-Leg Box Squat",
      "description": "A unilateral lower body exercise performed by standing up from a seated position on a box, bench, or chair using only one leg. It builds single-leg strength, balance, and concentric power, serving as a scalable progression towards pistol squats.",
      "targetBodyParts": [
        "Upper Legs"
      ],
      "exerciseType": [
        "strength"
      ],
      "difficulty": "intermediate",
      "equipment": [
        "Bodyweight",
        "Bench"
      ],
      "steps": [
        "Sit on the edge of a box or bench with feet flat on the floor.",
        "Extend one leg straight out in front, keeping the heel off the ground.",
        "Plant the foot of the supporting leg firmly on the floor, close to the bench.",
        "Lean your torso slightly forward, keeping your back straight and core engaged.",
        "Drive through the heel of the supporting leg to stand up fully, maintaining balance.",
        "Once standing, slowly and controllably lower yourself back to the seated starting position.",
        "Ensure the non-working foot remains off the ground throughout the movement.",
        "Complete reps on one side, then switch."
      ],
      "tips": [
        "Push through the mid-foot/heel of the supporting leg to initiate the upward movement.",
        "Use momentum from the slight forward lean to help stand up, but control the movement.",
        "Keep your chest up as you stand.",
        "Ensure the supporting knee tracks in line with your foot.",
        "Control the descent back to the box; avoid just dropping.",
        "Adjust box height to modify difficulty: higher is easier, lower is harder.",
        "If standing up on one leg is too difficult, practice the eccentric (lowering) phase only, sitting down on one leg and standing up with both."
      ],
      "contraindications": [
        "Upper Legs injury",
        "Significant knee or hip pain",
        "Acute pain during movement",
        "Severe balance impairments"
      ],
      "muscles": [
        "Quads",
        "Glutes",
        "Hamstrings",
        "Core"
      ],
      "alternatives": [
        "quads-51",
        "quads-191",
        "quads-28"
      ],
      "repetitions": 10,
      "sets": 3,
      "restBetweenSets": 60,
      "forceType": "Push (Unilateral)",
      "mechanics": "Compound",
      "videoUrl": "gs://musco-dc111.firebasestorage.app/exercise_videos/IMG_3750.MOV",
      "imageUrl": "https://cdn.muscleandstrength.com/sites/all/themes/mnsnew/images/taxonomy/exercises/muscle-groups/full/Upper Legs.jpg",
      "viewCount": 0,
      "popularity": "medium"
    },
    {
      "id": "quads-193",
      "name": "Wall Sit",
      "description": "The wall sit is an isometric lower-body endurance exercise where the individual holds a seated position with their back flat against a wall and knees bent to roughly 90 degrees. This static hold heavily recruits the quadriceps while also engaging the glutes, hamstrings, and core stabilizers. It's commonly used to build muscular endurance, improve joint stability, and increase time-under-tension for the lower body without joint impact.",
      "targetBodyParts": [
        "Upper Legs"
      ],
      "exerciseType": [
        "strength",
        "endurance"
      ],
      "difficulty": "beginner",
      "equipment": [
        "Bodyweight"
      ],
      "steps": [
        "Find a flat, empty wall and stand about two feet away from it, facing away from the wall.",
        "Lean back until your back is flat against the wall.",
        "Slowly slide your back down the wall until your thighs are parallel to the ground, creating a 90-degree angle at your knees.",
        "Adjust your feet if necessary so that your knees are directly above your ankles, not pushed forward over your toes.",
        "Position your arms either straight down at your sides, crossed over your chest, or straight out in front for different levels of challenge.",
        "Hold this position while maintaining normal breathing.",
        "Maintain the position for the prescribed time (typically 30-60 seconds for beginners).",
        "To finish, slowly slide back up the wall to the starting position."
      ],
      "tips": [
        "Keep knees stacked over ankles, not past toes.",
        "Maintain flat back contact with the wall—avoid arching.",
        "Keep the thighs parallel to the ground.",
        "Breathe slowly and avoid holding your breath (no valsalva).",
        "Start with shorter durations (20-30 seconds) and gradually increase as strength improves.",
        "Focus on proper form rather than maximum time under tension.",
        "If your legs begin to shake, that's a sign you're challenging the muscles effectively.",
        "For progression, try extending one leg straight out periodically, or holding small weights in your hands."
      ],
      "contraindications": [
        "Acute knee pain or injury",
        "Recent lower back injury",
        "Significant hypertension",
        "Acute joint inflammation"
      ],
      "muscles": [
        "Upper Legs",
        "Glutes",
        "Hamstrings",
        "Core"
      ],
      "alternatives": [
        "quads-190",
        "quads-1",
        "quads-5"
      ],
      "repetitions": 1,
      "sets": 3,
      "restBetweenSets": 60,
      "forceType": "Isometric",
      "mechanics": "Compound",
      "videoUrl": "gs://musco-dc111.firebasestorage.app/exercise_videos/IMG_4737.MOV",
      "imageUrl": "https://cdn.muscleandstrength.com/sites/all/themes/mnsnew/images/taxonomy/exercises/muscle-groups/full/Upper Legs.jpg",
      "viewCount": 0,
      "popularity": "medium"
    },
    {
      "id": "quads-194",
      "name": "Burpee",
      "description": "The burpee is a full-body conditioning exercise combining a squat, plank, and vertical jump in one continuous motion. From a standing position, you drop into a squat, kick your feet back into a push-up plank, return to squat, then explode upward into a jump. It builds explosive power, cardiovascular capacity, and muscular endurance using only bodyweight.",
      "targetBodyParts": [
        "Upper Legs",
        "Cardio"
      ],
      "exerciseType": [
        "cardio",
        "strength"
      ],
      "difficulty": "intermediate",
      "equipment": [
        "Bodyweight"
      ],
      "steps": [
        "Start standing with feet shoulder-width apart.",
        "Quickly lower your body into a squat position, placing your hands on the floor in front of you.",
        "Kick or step your feet back into a plank position (top of a push-up) with arms extended.",
        "Optional: Perform a push-up by bending and extending your elbows.",
        "Jump or step your feet back toward your hands, returning to the squat position.",
        "Explosively jump up into the air, reaching your arms overhead.",
        "Land softly with knees slightly bent and immediately begin the next repetition."
      ],
      "tips": [
        "Keep your core engaged throughout the entire movement.",
        "For beginners, step back into plank instead of jumping back.",
        "For lower impact, step up from squat position instead of jumping.",
        "Move at a controlled pace until you master the form, then increase speed.",
        "Breathe rhythmically - exhale during exertion (push-up, jump).",
        "Land softly with knees slightly bent to absorb impact.",
        "Keep your back flat during the plank portion.",
        "For added challenge, add a full push-up or perform a tuck jump at the top."
      ],
      "contraindications": [
        "Cardiovascular conditions",
        "Knee or ankle injuries",
        "Lower back problems",
        "Shoulder injuries",
        "Severe obesity",
        "Hypertension"
      ],
      "muscles": [
        "Quads",
        "Hamstrings",
        "Glutes",
        "Core",
        "Chest",
        "Shoulders"
      ],
      "alternatives": [
        "quads-190",
        "quads-1",
        "quads-5"
      ],
      "repetitions": 15,
      "sets": 3,
      "restBetweenSets": 60,
      "forceType": "Push",
      "mechanics": "Compound",
      "videoUrl": "gs://musco-dc111.firebasestorage.app/exercise_videos/IMG_4744.mov",
      "imageUrl": "https://cdn.muscleandstrength.com/sites/all/themes/mnsnew/images/taxonomy/exercises/muscle-groups/full/Upper Legs.jpg",
      "viewCount": 0,
      "popularity": "high"
    }
  ]
}