{
  "bodyPart": "Upper Arms",
  "exercises": [
    {
      "id": "triceps-4",
      "name": "Rope Tricep Extension",
      "description": "The rope tricep extension is a variation of the cable tricep extension and an exercise used to build the muscles of the triceps. Well-built triceps also have a lot of positive carryover into your pressing movements such as bench press variations and shoulder press variations. The rope tricep extension can be included in your tricep workouts, upper body workouts, push workouts, and full body workouts.",
      "targetBodyParts": [
        "Triceps"
      ],
      "exerciseType": [
        "strength"
      ],
      "difficulty": "beginner",
      "equipment": [
        "Cable"
      ],
      "steps": [
        "Attach a rope to a cable stack as high as possible and assume a standing position.",
        "Grasp the rope with a neutral grip (palms facing in) and lean forward slightly by hinging at the hips.",
        "Initiate the movement by extending the elbows and flexing the triceps.",
        "Pull the rope downward until the elbows are almost locked out and then slowly lower under control back to the starting position.",
        "Repeat for the desired number of repetitions."
      ],
      "tips": [
        "If you want to keep more tension in the triceps, don't lock the elbows out entirely.",
        "Imagine there's a screw running through your elbow and don't allow them to move in front of the body as you extend at the bottom of the movement.",
        "Experiment with static elbow positioning throughout the lift - some may find that they get a better stretch in the bottom portion of the movement by allowing their elbows to drift behind the body during the eccentric portion of the movement (similar to a drag curl).",
        "Ensure the shoulder blades don't tilt forward as you extend the elbows."
      ],
      "contraindications": [
        "Triceps injury",
        "Joint pain",
        "Acute pain during movement",
        "Shoulder impingement"
      ],
      "muscles": [
        "Triceps"
      ],
      "alternatives": [
        "triceps-21",
        "triceps-23",
        "triceps-107",
        "triceps-11"
      ],
      "repetitions": 12,
      "sets": 3,
      "restBetweenSets": 60,
      "forceType": "Push (Bilateral)",
      "mechanics": "Isolation",
      "videoUrl": "gs://musco-dc111.firebasestorage.app/exercise_videos/IMG_2992.MOV",
      "imageUrl": "https://cdn.muscleandstrength.com/sites/all/themes/mnsnew/images/taxonomy/exercises/muscle-groups/full/Triceps.jpg",
      "viewCount": 2500000,
      "popularity": "high"
    },
    {
      "id": "triceps-11",
      "name": "French Press",
      "targetBodyParts": [
        "Triceps"
      ],
      "exerciseType": [
        "strength"
      ],
      "difficulty": "beginner",
      "equipment": [
        "Barbell"
      ],
      "steps": [
        "Set up for the french press by loading a barbell or EZ-bar with the appropriate amount of weight and placing it on the floor in front of you.",
        "Bend only at the knees and grasp the barbell with an overhand grip (palms facing down) with your hands about 8-12 inches apart.",
        "Stand up straight with the bar with your feet around shoulder-width apart and a slight bend in your knees.",
        "Lift the bar above your head and bend at your elbows slightly to take the tension onto your triceps. Your palms are now facing upward. This is the starting position for the exercise.",
        "Keeping your elbows fixed and pointing straight up toward the ceiling, slowly lower the bar down behind your head as far as comfortably possible.",
        "Pause, and then slowly raise the bar back to the starting position.",
        "Don\"t lock your elbows out, and then repeat the movement."
      ],
      "tips": [
        "Technique is really important! Don\"t let your elbows flare out as you move the barbell, and keep the rep timing slow and controlled.",
        "Don\"t lock your elbows out at the top of the movement and take the tension off of your triceps.",
        "Focus on keeping your body as still as possible, moving only your forearms.",
        "Keep your head up and your eyes facing forward through the movement."
      ],
      "contraindications": [
        "Triceps injury",
        "Joint pain",
        "Acute pain during movement",
        "Shoulder impingement"
      ],
      "muscles": [
        "Triceps"
      ],
      "alternatives": [
        "triceps-107",
        "triceps-23",
        "triceps-4",
        "triceps-21"
      ],
      "repetitions": 12,
      "sets": 3,
      "restBetweenSets": 60,
      "forceType": "Push",
      "mechanics": "Isolation",
      "videoUrl": "gs://musco-dc111.firebasestorage.app/exercise_videos/IMG_3110.MOV",
      "imageUrl": "https://cdn.muscleandstrength.com/sites/all/themes/mnsnew/images/taxonomy/exercises/muscle-groups/full/Triceps.jpg",
      "viewCount": 1500000,
      "popularity": "high"
    },
    {
      "id": "triceps-17",
      "name": "Bench Dip",
      "targetBodyParts": [
        "Triceps"
      ],
      "exerciseType": [
        "strength"
      ],
      "difficulty": "beginner",
      "equipment": [
        "Bodyweight"
      ],
      "steps": [
        "Set up for the bench dip by placing 2 flat benches parallel to one another to around 4-5 feet apart (you may need to adjust the width to suit your height).",
        "Put your heels on the edge of one bench around shoulder-width apart.",
        "Place your hands on the edge of the other bench. This is the starting position for the exercise.",
        "Keeping your body close to the bench, slowly dip down until your elbows are at the same height as your shoulders.",
        "Slowly push back up, squeezing through the triceps.",
        "Do not lock the elbows out at the top of the exercise, and repeat."
      ],
      "tips": [
        "Keep your forearms pointing downward and try to keep your elbows close.",
        "It\"s important that you do not dip down too low as it places unnecessary strain on the shoulder joints.",
        "Keep the rep timing slow.",
        "Really squeeze the triceps at the top of the movement to get the most out of this exercise. Mentally focusing on the triceps being the prime mover in this exercise will help place more emphasis on the triceps and less on the shoulders."
      ],
      "contraindications": [
        "Triceps injury",
        "Joint pain",
        "Acute pain during movement",
        "Shoulder impingement",
        "Recent surgery",
        "Severe cardiovascular issues (for heavy compound movements)"
      ],
      "muscles": [
        "Triceps",
        "Shoulders"
      ],
      "alternatives": [
        "triceps-11",
        "triceps-4",
        "triceps-21",
        "triceps-107"
      ],
      "repetitions": 12,
      "sets": 3,
      "restBetweenSets": 60,
      "forceType": "Push",
      "mechanics": "Compound",
      "videoUrl": "gs://musco-dc111.firebasestorage.app/exercise_videos/IMG_3126.MOV",
      "imageUrl": "https://cdn.muscleandstrength.com/sites/all/themes/mnsnew/images/taxonomy/exercises/muscle-groups/full/Triceps.jpg",
      "viewCount": 1300000,
      "popularity": "high"
    },
    {
      "id": "triceps-21",
      "name": "One-Arm Cable Tricep Extension",
      "targetBodyParts": [
        "Triceps"
      ],
      "exerciseType": [
        "strength"
      ],
      "difficulty": "beginner",
      "equipment": [
        "Cable"
      ],
      "steps": [
        "Set up for the one-arm cable tricep extension by attaching a single grip handle to a high pulley cable and selecting the weight you want to use on the stack.",
        "Stand facing the machine and grab the handle with an overhand grip.",
        "Pull your elbow down and keep it tucked in at your wide. You can use your free arm for support.",
        "Keeping your body fixed, slowly extend the arm as far as possible.",
        "Pause and squeeze the tricep muscle, and then slowly lower the weight.",
        "Repeat this motion for desired reps, and then repeat for the right arm."
      ],
      "tips": [
        "All of your body should remain still throughout the movement and your elbow should remain tucked in at your side. Do not move your elbow at all!",
        "Squeeze the tricep for a count of 2 at the top of the movement for added intensity."
      ],
      "contraindications": [
        "Triceps injury",
        "Joint pain",
        "Acute pain during movement",
        "Shoulder impingement"
      ],
      "muscles": [
        "Triceps"
      ],
      "alternatives": [
        "triceps-23",
        "triceps-4",
        "triceps-107",
        "triceps-11"
      ],
      "repetitions": 12,
      "sets": 3,
      "restBetweenSets": 60,
      "forceType": "Push",
      "mechanics": "Isolation",
      "videoUrl": "gs://musco-dc111.firebasestorage.app/exercise_videos/IMG_3123.MOV",
      "imageUrl": "https://cdn.muscleandstrength.com/sites/all/themes/mnsnew/images/taxonomy/exercises/muscle-groups/full/Triceps.jpg",
      "viewCount": 352800,
      "popularity": "medium"
    },
    {
      "id": "triceps-23",
      "name": "Standing Low Pulley Overhead Tricep Extension",
      "targetBodyParts": [
        "Triceps"
      ],
      "exerciseType": [
        "strength"
      ],
      "difficulty": "beginner",
      "equipment": [
        "Cable"
      ],
      "steps": [
        "Set up for the exercise by attaching a rope to the low pulley of a pulley cable machine and selecting the weight you want to use on the stack.",
        "Facing away from the pulley, grab the rope behind your neck with a neutral grip.",
        "Keep your feet around shoulder width apart. Your forearms should be parallel to the floor at this point and your elbows should be pointed at the ceiling.",
        "You should be grasping the rope behind your head. You are now in the starting position.",
        "Moving only at your elbow joints slowly push the rope straight up until your arms are fully extended. As you push, spread the rope out until your hands are around shoulder width apart at the peak of the movement.",
        "Pause, and then slowly bring the rope back to the starting position allowing your hands to reunite.",
        "Repeat this movement for desired reps."
      ],
      "tips": [
        "Focus on moving the weight with your triceps, keeping control of the weight as you slowly lower the weight stack back to the starting position.",
        "Keep your body as still as possible, moving only your forearms.",
        "Keep your head up and look straight ahead throughout the movement."
      ],
      "contraindications": [
        "Triceps injury",
        "Joint pain",
        "Acute pain during movement",
        "Shoulder impingement"
      ],
      "muscles": [
        "Triceps"
      ],
      "alternatives": [
        "triceps-21",
        "triceps-4",
        "triceps-11",
        "triceps-107"
      ],
      "repetitions": 12,
      "sets": 3,
      "restBetweenSets": 60,
      "forceType": "Push",
      "mechanics": "Isolation",
      "videoUrl": "gs://musco-dc111.firebasestorage.app/exercise_videos/IMG_3122.MOV",
      "imageUrl": "https://cdn.muscleandstrength.com/sites/all/themes/mnsnew/images/taxonomy/exercises/muscle-groups/full/Triceps.jpg",
      "viewCount": 239900,
      "popularity": "medium"
    },
    {
      "id": "triceps-107",
      "name": "Dumbbell Tricep Extension",
      "description": "The flat bench dumbbell tricep extension is a fundamental exercise for isolating and developing the triceps muscles. Performed lying flat on a bench, this movement allows for optimal stability and control while targeting all three heads of the triceps. The flat position helps maintain consistent tension throughout the movement and can be particularly effective for developing triceps strength and size.",
      "targetBodyParts": [
        "Triceps"
      ],
      "exerciseType": [
        "strength"
      ],
      "difficulty": "beginner",
      "equipment": [
        "Dumbbell",
        "Bench"
      ],
      "steps": [
        "Lie flat on a bench with your feet planted firmly on the ground.",
        "Hold a dumbbell in each hand and press them straight up over your chest with palms facing each other (neutral grip).",
        "Keeping your upper arms stationary and pointing towards the ceiling, slowly bend your elbows to lower the dumbbells towards your forehead.",
        "Lower until you feel a good stretch in your triceps, typically when your forearms are just past parallel to the ground.",
        "Pause briefly at the bottom, then extend your arms back to the starting position by contracting your triceps.",
        "Maintain control throughout the movement and avoid letting the dumbbells drift forward or backward."
      ],
      "tips": [
        "Keep your elbows pointed straight up throughout the movement, don't let them flare out.",
        "Maintain a neutral grip (palms facing each other) to reduce stress on the wrists and elbows.",
        "Focus on moving only at the elbow joint - your upper arms should remain vertical and stable.",
        "Control the weight especially during the lowering phase to maximize triceps engagement.",
        "If you're new to the exercise, start with lighter weights to perfect your form."
      ],
      "contraindications": [
        "Triceps injury",
        "Elbow pain or injury",
        "Shoulder impingement",
        "Wrist issues",
        "Acute pain during movement"
      ],
      "muscles": [
        "Triceps"
      ],
      "alternatives": [
        "triceps-11",
        "triceps-23",
        "triceps-4",
        "triceps-21"
      ],
      "repetitions": 12,
      "sets": 3,
      "restBetweenSets": 60,
      "forceType": "Push (Bilateral)",
      "mechanics": "Isolation",
      "videoUrl": "gs://musco-dc111.firebasestorage.app/exercise_videos/IMG_3111.MOV",
      "imageUrl": "https://cdn.muscleandstrength.com/sites/all/themes/mnsnew/images/taxonomy/exercises/muscle-groups/full/Triceps.jpg",
      "viewCount": 0,
      "popularity": "medium"
    }
  ]
}